{"intents": [
    {"tag": "ar_ask_cancer_risk",
        "patterns":[
          "ما هي مخاطر الإصابة بالسرطان",
          "ما هي المخاطر الشائعة فيما يتعلق بالسرطان",
          "ما هي عوامل خطر الإصابة بالسرطان؟",
          "هل يمكنك أن تخبرني عن عوامل خطر الإصابة بالسرطان؟",
          "أنا قلق بشأن مخاطر الإصابة بالسرطان"],
        "responses": ["بالتأكيد! تشمل عوامل الخطر الشائعة للإصابة بالسرطان العوامل الوراثية والتدخين والإفراط في تناول الكحول والسمنة والتعرض لبعض المواد الكيميائية أو الإشعاع. من المهم أن تكوني على دراية بهذه العوامل واتخاذ الاحتياطات اللازمة.",
        "بالطبع! يمكن أن تنبع عوامل خطر الإصابة بالسرطان من العوامل الوراثية أو خيارات نمط الحياة مثل التدخين والنظام الغذائي أو العوامل البيئية مثل التعرض للإشعاع. إن الانتباه لهذه العوامل أمر ضروري للرعاية الوقائية."],
            "context": ["risks"]
    },
    {"tag": "ar_ask_detection_methods",
    "patterns":["كيفية اكتشاف السرطان",
    "ما هي الطرق التي يمكن بها اكتشاف السرطان",
    "كيف يمكن للمرء أن يعرف إن كان مصاباً بالسرطان",
    "كيف يتم الكشف عن السرطان لدى الأفراد الذين لا تظهر عليهم أعراض؟",
    "ما هي طرق الكشف عن السرطان بدون أعراض؟",
    "هل يمكنك أن تشرح كيف يتم اكتشاف السرطان لدى الأشخاص الذين لا تظهر عليهم أعراض؟",
    "هل يمكنك شرح طرق الكشف المبكر عن السرطان؟",
    "أخبرني المزيد عن طرق الكشف المبكر عن السرطان",
    "هل يمكنك شرح طرق الكشف المبكر عن السرطان؟", 
    "أريد أن أعرف عن طرق الكشف عن السرطان بدون أعراض", 
    "أريد أن أعرف عن طرق الكشف عن السرطان بدون أعراض",
    "هل يمكنك توضيح الطرق المستخدمة لاكتشاف السرطان في حالة عدم وجود أعراض؟",
    "طرق اكتشاف السرطان لدى الأشخاص الذين لا تظهر عليهم أعراض",
    "ما هي طرق اكتشاف السرطان في وقت مبكر؟",
    "كيف يقوم الأطباء بتشخيص السرطان"],
    "responses": [
      "بالتأكيد! يمكن الكشف عن السرطان لدى الأفراد الذين لا تظهر عليهم أعراض من خلال طرق مختلفة مثل اختبارات التصوير (مثل التصوير بالرنين المغناطيسي والأشعة المقطعية)، واختبارات الدم، والخزعة، والاختبارات الجينية، والتنظير الداخلي وتنظير القولون، واختبار مسحة عنق الرحم وفيروس الورم الحليمي البشري، واختبار المستضد البروستاتي النوعي (PSA)، والفحص البدني. تساعد هذه الاختبارات في الكشف المبكر، مما يوفر فرصاً أفضل للعلاج الناجح.",
      "بالتأكيد! تشمل طرق الاكتشاف المبكر للسرطان لدى الأفراد الذين لا تظهر عليهم أعراض السرطان فحوصات مثل تصوير الثدي بالأشعة السينية وتنظير القولون واختبارات الدم لعلامات ورم معينة. هذه الفحوصات ضرورية للتشخيص في الوقت المناسب والعلاج الفعال.",
      "التعرف على الصور: التعرف على الصور هو مجال من مجالات الذكاء الاصطناعي حيث يتم تدريب أجهزة الكمبيوتر على تفسير وفهم المعلومات المرئية، مثل الصور أو مقاطع الفيديو.  في تشخيص السرطان، تُستخدم تقنيات التعرف على الصور لتحليل الصور الطبية مثل الأشعة السينية والأشعة المقطعية والتصوير بالرنين المغناطيسي.<br>الشبكات العصبية التلافيفية (CNNs) هي نوع شائع من نماذج الذكاء الاصطناعي للتعرف على الصور في الكشف عن السرطان.<br>التحليل الجينومي: <br>يتضمن التحليل الجينومي دراسة المادة الوراثية للفرد (الجينوم) لتحديد الاختلافات والطفرات الجينية.<br>يمكن استخدام التحليل الجينومي للعثور على طفرات جينية محددة مرتبطة بالسرطان. وهو ضروري لفهم الأساس الوراثي للسرطان ويمكنه أن يُعلم استراتيجيات العلاج الشخصي. تحديد طفرات محددة في جينات BRCA1 و BRCA2، والتي ترتبط بزيادة خطر الإصابة بسرطان الثدي والمبيض.<br>اختبارات الفحص: <br>إجراء اختبارات فحص محددة مناسبة لنوع السرطان الذي يتم النظر فيه. قد تتضمن هذه الاختبارات ما يلي:<br> التصوير الشعاعي للثدي لسرطان الثدي<br> تنظير القولون لسرطان القولون والمستقيم"],
        "context": ["cancer","detection"]
    },
    

    
    {"tag": "ar_options",
        "patterns": ["كيف يمكنكم مساعدتي؟", "ما الذي يمكنكم فعله؟", "ما هي المساعدة التي تقدمونها؟", "كيف يمكنكم تقديم المساعدة؟", "ما هو الدعم المقدم؟"],
        "responses": [
          "يمكنني تقديم نصائح حول مخاطر الإصابة بسرطان القولون والمستقيم وسرطان الثدي",
          "يمكنني تقديم معلومات مفصلة حول سرطان القولون والمستقيم وسرطان الثدي، بما في ذلك عوامل الخطر والأعراض والتشخيص وخيارات العلاج واستراتيجيات الوقاية",
          "لا تتردد في طرح أسئلة حول سرطان القولون والمستقيم أو سرطان الثدي. وسأبذل قصارى جهدي لتقديم معلومات دقيقة ومفيدة بناءً على استفساراتك.",
          "يمكنني مساعدتك في فهم عوامل الخطورة المرتبطة بسرطان القولون والمستقيم وسرطان الثدي، بما يتناسب مع مخاوفك الخاصة أو تاريخ عائلتك المرضي.",
          "يمكنني إرشادك خلال اختبارات الفحص الموصى بها لسرطان القولون والمستقيم وسرطان الثدي وشرح أهميتها في الكشف المبكر.",
          "يمكنني تقديم نظرة ثاقبة حول خيارات العلاج المختلفة المتاحة لسرطان القولون والمستقيم وسرطان الثدي، ومساعدتك على فهم الأساليب المختلفة وتأثيراتها.",
          "يمكنني توجيهك إلى مجموعات الدعم والمواقع الإلكترونية ذات السمعة الطيبة والمصادر المتخصصة في سرطان القولون والمستقيم وسرطان الثدي للحصول على مزيد من المعلومات أو المساعدة.",
          "يمكنني تقديم المشورة بشأن تغيير نمط الحياة وجداول الفحوصات والتدابير الوقائية الخاصة بالحد من خطر الإصابة بسرطان القولون والمستقيم وسرطان الثدي."
        ],
        "context": ["help"]
    },


    {"tag": "ar_BreastCancer",
    "patterns": ["ما هو سرطان الثدي","ما هو سرطان الثدي؟", "ما هو سرطان الثدي؟"],
    "responses": ["سرطان الثدي هو نوع من السرطان الذي يتكوّن في خلايا الثدي. وهو يصيب في المقام الأول أنسجة الثدي ويمكن أن يتطور في أجزاء مختلفة من الثدي، وغالباً ما يكون في القنوات التي تحمل الحليب إلى الحلمة (سرطان الأقنية) أو الغدد التي تنتج الحليب (سرطان فصيصيصي)."],
    "context": ["MoreInfoBC", "picAvail"]
    },
    {"tag": "ar_MoreInfoBC",
    "patterns": ["أخبرني المزيد من المعلومات عن سرطان الثدي"],
    "responses": ["سرطان الثدي هو أحد أكثر أنواع السرطانات شيوعًا بين النساء في جميع أنحاء العالم، ولكنه قد يصيب الرجال أيضًا، وإن كان بوتيرة أقل. إن الكشف المبكر من خلال الفحوصات المنتظمة والعناية الطبية الفورية يحسن بشكل كبير من نتائج العلاج ومعدلات البقاء على قيد الحياة. ولذلك، فإن الوعي بأعراض سرطان الثدي وعوامل الخطر وطلب المشورة الطبية في الوقت المناسب أمر بالغ الأهمية من أجل إدارة فعالة وتشخيص أفضل"]
    },
    {"tag": "TreatmentForBC",
    "patterns": ["طرق علاج سرطان الثدي",
    "ما هي العلاجات الأساسية المتاحة لسرطان الثدي؟",
    "هل يمكنك تقديم لمحة عامة عن العلاجات المختلفة المستخدمة في علاج سرطان الثدي؟",
    "ما أنواع العلاجات المستخدمة عادةً لعلاج سرطان الثدي؟"],
    "responses": ["يعتمد علاج سرطان الثدي على عوامل مختلفة مثل مرحلة السرطان ونوعه وما إذا كان حساساً للهرمونات أم لا والصحة العامة للفرد. فيما يلي طرق العلاج الأساسية الشائعة الاستخدام: الجراحة والعلاج الإشعاعي والعلاج الكيميائي والعلاج الهرموني والعلاج الاستهدافي والعلاج المناعي والجراحة الترميمية"]
    },


    {"tag": "ar_ColorectalCancer",
    "patterns": ["ما هو سرطان القولون والمستقيم"],
    "responses": ["سرطان القولون والمستقيم، والمعروف أيضاً بسرطان الأمعاء أو سرطان القولون، يشير إلى السرطان الذي ينشأ في القولون أو المستقيم. القولون هو الأمعاء الغليظة، بينما المستقيم هو الجزء الأخير من الأمعاء الغليظة قبل فتحة الشرج. يبدأ سرطان القولون والمستقيم عادةً على شكل أورام صغيرة حميدة تسمى السلائل التي يمكن أن تتطور تدريجياً إلى سرطان مع مرور الوقت."],
    "context": ["MoreInfoCC", "picAvail"]
    },
    {"tag": "ar_MoreInfoCC",
    "patterns": ["أخبرني المزيد من المعلومات عن سرطان القولون والمستقيم"],
    "responses": ["يُعد سرطان القولون والمستقيم مشكلة صحية كبيرة في جميع أنحاء العالم. ويمكن للكشف المبكر من خلال الفحوصات المنتظمة والوعي بعوامل الخطر وطلب المشورة الطبية بشأن الأعراض المقلقة أن يحسن بشكل كبير من فرص نجاح العلاج ومعدلات البقاء على قيد الحياة."],
    "context": ["cancer","colon"]
    },
    {"tag": "ar_TreatmentForCC",
    "patterns": ["طرق علاج سرطان القولون والمستقيم",
    "ما هي طرق العلاج المتاحة لسرطان القولون والمستقيم؟",
    "هل يمكنك أن تخبرني عن خيارات العلاج المختلفة لسرطان القولون والمستقيم", 
    "ما نوع العلاجات التي تُستخدم عادةً لعلاج سرطان القولون والمستقيم؟"],
    "responses": ["يعتمد علاج سرطان القولون والمستقيم على المرحلة والموقع والعوامل الفردية. فيما يلي طرق العلاج الأساسية الشائعة الاستخدام: الجراحة، والعلاج الإشعاعي، والعلاج الكيميائي، والعلاج بالهرمونات، والعلاج المناعي، وجراحة الفغرة، والتجارب السريرية"]
    },


    {
        "tag": "ar_ProstateCancer",
        "patterns": ["أخبرني عن سرطان البروستاتا", "ما هو سرطان البروستاتا"],
        "responses": ["يبدأ سرطان البروستاتا في غدة البروستاتا وهو شائع لدى الرجال الأكبر سناً. وتشمل عوامل الخطر العمر والتاريخ العائلي. قد يتضمن التشخيص إجراء اختبار المستضد البروستاتا النوعي وخزعة البروستاتا."],
        "context": ["MoreInfo_ProstateCancer", "picAvail"]
    },
    {
        "tag": "ar_OvarianCancer",
        "patterns": ["ما هو سرطان المبيض"],
        "responses": ["يمكن أن تكون أعراض سرطان المبيض خفية، بما في ذلك الانتفاخ وآلام الحوض. قد يتضمن العلاج الجراحة والعلاج الكيميائي. تشمل طرق الكشف فحوصات الحوض وفحوصات التصوير."],
        "context": ["MoreInfo_OvarianCancer", "picAvail"]
    },
    {
        "tag": "ar_Leukemia",
        "patterns": ["ما هو سرطان الدم؟", "أخبرني عن سرطان الدم"],
        "responses": ["ابيضاض الدم هو نوع من سرطان الدم الذي يصيب نخاع العظم. قد يتضمن العلاج العلاج الكيميائي وزرع الخلايا الجذعية والعلاجات الموجهة. يشمل التشخيص اختبارات الدم وخزعة نخاع العظم."],
        "context": ["MoreInfo_Leukemia", "picAvail"]
    },
    {
        "tag": "ar_Lymphoma",
        "patterns": ["ما هي الأنواع المختلفة لسرطان الغدد اللمفاوية؟"],
        "responses": ["لمفوما هو سرطان يصيب الجهاز اللمفاوي. وتشمل أنواعه لمفومة هودجكين وغير هودجكين. قد يشمل العلاج العلاج الكيميائي والعلاج المناعي والعلاج الإشعاعي. يشمل التشخيص فحوصات التصوير وخزعة."],
        "context": ["MoreInfo_Lymphoma", "picAvail"]
    },
    {
        "tag": "ar_Melanoma",
        "patterns": ["أخبرني عن الميلانوما", "ما هو سرطان الجلد؟"],
        "responses": ["الميلانوما هو نوع من سرطان الجلد يرتبط غالباً بالتعرض لأشعة الشمس. تشمل العلامات تغيرات في الشامات. قد يتضمن العلاج الجراحة والعلاج المناعي والعلاج الموجه. الاكتشاف المبكر أمر بالغ الأهمية للتوصل إلى تشخيص جيد."],
        "context": ["MoreInfo_Melanoma", "picAvail"]
    },
    {
        "tag": "ar_PancreaticCancer",
        "patterns": ["ما هو سرطان البنكرياس"],
        "responses": ["تشمل أعراض سرطان البنكرياس ألم البطن وفقدان الوزن. قد يتضمن العلاج الجراحة والعلاج الكيميائي والإشعاعي. يشمل التشخيص فحوصات التصوير وخزعة."],
        "context": ["MoreInfo_PancreaticCancer", "picAvail"]
    },
    {
        "tag": "ar_BladderCancer",
        "patterns": ["أخبرني عن سرطان المثانة", "ما هو سرطان المثانة"],
        "responses": ["يؤثر سرطان المثانة على بطانة المثانة. وتشمل عوامل الخطر التدخين والتعرض لبعض المواد الكيميائية. قد يتضمن العلاج الجراحة والعلاج المناعي والعلاج الكيميائي. يشمل التشخيص تنظير المثانة وأخذ خزعة."],
        "context": ["MoreInfo_BladderCancer", "picAvail"]
    },
    {
        "tag": "ar_KidneyCancer",
        "patterns": ["ما هو سرطان الكلى"],
        "responses": ["قد تشمل أعراض سرطان الكلى وجود دم في البول وآلام أسفل الظهر. قد يشمل العلاج الجراحة والعلاج الموجه والعلاج المناعي. يشمل التشخيص فحوصات التصوير وخزعة."],
        "context": ["MoreInfo_KidneyCancer", "picAvail"]
    },
    {
        "tag": "ar_LiverCancer",
        "patterns": ["أخبرني عن سرطان الكبد", "ما هو سرطان الكبد"],
        "responses": ["يمكن أن يكون سرطان الكبد أولياً أو ثانوياً. وتشمل عوامل الخطر أمراض الكبد المزمنة. قد يتضمن العلاج الجراحة والاستئصال والعلاج الموجه. يشمل التشخيص فحوصات التصوير وخزعة."],
        "context": ["MoreInfo_LiverCancer", "picAvail"]
    },
    {
        "tag": "ar_ThyroidCancer",
        "patterns": ["ما هي أنواع سرطان الغدة الدرقية؟", "أخبرني عن سرطان الغدة الدرقية", "ما هو سرطان الغدة الدرقية"],
        "responses": ["يشمل سرطان الغدة الدرقية الأنواع الحليمية والجريبية والنخاعية. قد يشمل العلاج الجراحة واليود المشع والعلاج الهرموني. يشمل التشخيص خزعة الغدة الدرقية واختبارات التصوير."],
        "context": ["MoreInfo_ThyroidCancer", "picAvail"]
    },
    {
        "tag": "ar_CervicalCancer",
        "patterns": ["أخبرني عن سرطان عنق الرحم", "ما هو سرطان عنق الرحم؟"],
        "responses": ["يصيب سرطان عنق الرحم عنق الرحم. وتشمل عوامل الخطر الإصابة بفيروس الورم الحليمي البشري. قد يشمل العلاج الجراحة والعلاج الإشعاعي والعلاج الكيميائي. يشمل التشخيص اختبارات عنق الرحم وفحص فيروس الورم الحليمي البشري."],
        "context": ["MoreInfo_CervicalCancer", "picAvail"]
    },
    {
        "tag": "ar_GastricCancer",
        "patterns": ["ما هو سرطان المعدة؟", "أخبرني عن سرطان المعدة"],
        "responses": ["يؤثر سرطان المعدة على بطانة المعدة. تشمل الأعراض عسر الهضم وفقدان الوزن. قد يتضمن العلاج الجراحة والعلاج الكيميائي والعلاج الموجه. يشمل التشخيص التنظير الداخلي وأخذ خزعة."],
        "context": ["MoreInfo_GastricCancer", "picAvail"]},

    {
        "tag": "ar_MoreInfo_LungCancer",
        "patterns": ["أخبرني المزيد عن سرطان الرئة", "هل يمكنك تقديم معلومات إضافية عن سرطان الرئة؟", "أحتاج إلى مزيد من التفاصيل حول سرطان الرئة"],
        "responses": ["من المؤكد أن سرطان الرئة يبدأ في الرئتين ويمكن أن يسبب أعراضاً مثل السعال المستمر وألم الصدر وضيق التنفس. ويتضمن التشخيص إجراء فحوصات بالأشعة والخزعات."]
    },
    {
        "tag": "ar_MoreInfo_ProstateCancer",
        "patterns": ["أخبرني المزيد عن سرطان البروستاتا", "هل يمكنك تقديم معلومات إضافية عن سرطان البروستاتا؟", "أحتاج إلى مزيد من التفاصيل حول سرطان البروستاتا"],
        "responses": ["بطبيعة الحال، يبدأ سرطان البروستاتا في غدة البروستاتا وهو شائع لدى الرجال الأكبر سناً. وتشمل عوامل الخطر العمر والتاريخ العائلي. قد يتضمن التشخيص إجراء اختبار المستضد البروستاتا النوعي (PSA) وخزعة البروستاتا."]
    },
    {
        "tag": "ar_MoreInfo_OvarianCancer",
        "patterns": ["أخبرني المزيد عن سرطان المبيض", "هل يمكنك تقديم معلومات إضافية عن سرطان المبيض؟", "أحتاج إلى مزيد من التفاصيل عن سرطان المبيض"],
        "responses": ["من المؤكد أن أعراض سرطان المبيض يمكن أن تكون خفية، بما في ذلك الانتفاخ وآلام الحوض. قد يشمل العلاج الجراحة والعلاج الكيميائي. وتشمل طرق الكشف فحوصات الحوض وفحوصات التصوير بالأشعة."]
    },
    {
        "tag": "ar_MoreInfo_Leukemia",
        "patterns": ["أخبرني المزيد عن سرطان الدم", "هل يمكنك تقديم معلومات إضافية عن سرطان الدم؟", "أحتاج إلى مزيد من التفاصيل عن سرطان الدم"],
        "responses": ["بالطبع، ابيضاض الدم هو نوع من سرطان الدم الذي يصيب نخاع العظم. قد يتضمن العلاج العلاج الكيميائي وزرع الخلايا الجذعية والعلاجات الموجهة. يشمل التشخيص اختبارات الدم وخزعة نخاع العظم."]
    },
    {
        "tag": "ar_MoreInfo_Lymphoma",
        "patterns": ["أخبرني المزيد عن سرطان الغدد اللمفاوية", "هل يمكنك تقديم معلومات إضافية عن سرطان الغدد اللمفاوية؟"],
        "responses": ["من المؤكد أن سرطان الغدد اللمفاوية هو سرطان يصيب الجهاز اللمفاوي. وتشمل أنواعه لمفومة هودجكين وغير هودجكين. قد يتضمن العلاج العلاج الكيميائي والعلاج المناعي والعلاج الإشعاعي. يشمل التشخيص فحوصات التصوير وخزعة."]
    },
    {
        "tag": "ar_MoreInfo_Melanoma",
        "patterns": ["أخبرني المزيد عن الورم الميلانيني", "هل يمكنك تقديم معلومات إضافية عن الورم الميلانيني؟"],
        "responses": ["بالطبع، الميلانوما هو نوع من سرطان الجلد يرتبط غالباً بالتعرض لأشعة الشمس. تشمل العلامات تغيرات في الشامات. قد يتضمن العلاج الجراحة والعلاج المناعي والعلاج الموجه. الاكتشاف المبكر أمر بالغ الأهمية للتشخيص الجيد."]
    },
    {
        "tag": "ar_MoreInfo_PancreaticCancer",
        "patterns": ["أخبرني المزيد عن سرطان البنكرياس", "هل يمكنك تقديم معلومات إضافية عن سرطان البنكرياس؟", "أحتاج إلى مزيد من التفاصيل حول سرطان البنكرياس"],
        "responses": ["بالتأكيد، تشمل أعراض سرطان البنكرياس آلام البطن وفقدان الوزن. قد يشمل العلاج الجراحة والعلاج الكيميائي والعلاج الإشعاعي. يشمل التشخيص فحوصات التصوير وخزعة."]
    },
    {
        "tag": "ar_MoreInfo_BladderCancer",
        "patterns": ["أخبرني المزيد عن سرطان المثانة", "هل يمكنك تقديم معلومات إضافية عن سرطان المثانة؟", "أحتاج إلى مزيد من التفاصيل حول سرطان المثانة"],
        "responses": ["بالطبع، يؤثر سرطان المثانة على بطانة المثانة. تشمل عوامل الخطر التدخين والتعرض لبعض المواد الكيميائية. قد يشمل العلاج الجراحة والعلاج المناعي والعلاج الكيميائي. يشمل التشخيص تنظير المثانة وأخذ خزعة."]
    },
    {
        "tag": "ar_MoreInfo_KidneyCancer",
        "patterns": ["أخبرني المزيد عن سرطان الكلى", "هل يمكنك تقديم معلومات إضافية عن سرطان الكلى؟", "أحتاج إلى مزيد من التفاصيل حول سرطان الكلى", "أحتاج إلى مزيد من التفاصيل حول سرطان الكلى"],
        "responses": ["بالتأكيد، قد تشمل أعراض سرطان الكلى وجود دم في البول وآلام أسفل الظهر. قد يتضمن العلاج الجراحة والعلاج الموجه والعلاج المناعي. يشمل التشخيص فحوصات التصوير وخزعة."]
    },
    {
        "tag": "ar_MoreInfo_LiverCancer",
        "patterns": ["أخبرني المزيد عن سرطان الكبد", "هل يمكنك تقديم معلومات إضافية عن سرطان الكبد؟", "أحتاج إلى مزيد من التفاصيل حول سرطان الكبد", "أحتاج إلى مزيد من التفاصيل حول سرطان الكبد"],
        "responses": ["بالطبع، يمكن أن يكون سرطان الكبد أولياً أو ثانوياً. تشمل عوامل الخطر أمراض الكبد المزمنة. قد يتضمن العلاج الجراحة والاستئصال والعلاج الموجه. يشمل التشخيص فحوصات التصوير وخزعة."]
    },
    {
        "tag": "ar_MoreInfo_ThyroidCancer",
        "patterns": ["أخبرني المزيد عن سرطان الغدة الدرقية", "هل يمكنك تقديم معلومات إضافية عن سرطان الغدة الدرقية؟", "أحتاج إلى مزيد من التفاصيل حول سرطان الغدة الدرقية"],
        "responses": ["بالتأكيد، يشمل سرطان الغدة الدرقية الأنواع الحليمية والجريبية والنخاعية. قد يشمل العلاج الجراحة واليود المشع والعلاج الهرموني. يشمل التشخيص خزعة الغدة الدرقية واختبارات التصوير."]
    },
    {
        "tag": "ar_MoreInfo_CervicalCancer",
        "patterns": ["أخبرني المزيد عن سرطان عنق الرحم", "هل يمكنك تقديم معلومات إضافية عن سرطان عنق الرحم؟", "أحتاج إلى مزيد من التفاصيل حول سرطان عنق الرحم", "أحتاج إلى مزيد من التفاصيل حول سرطان عنق الرحم"],
        "responses": ["بالطبع، يصيب سرطان عنق الرحم عنق الرحم. تشمل عوامل الخطر الإصابة بفيروس الورم الحليمي البشري. قد يشمل العلاج الجراحة والعلاج الإشعاعي والعلاج الكيميائي. يشمل التشخيص اختبارات عنق الرحم واختبار فيروس الورم الحليمي البشري."]
    },
    {
        "tag": "ar_MoreInfo_GastricCancer",
        "patterns": ["أخبرني المزيد عن سرطان المعدة", "هل يمكنك تقديم معلومات إضافية عن سرطان المعدة؟", "أحتاج إلى مزيد من التفاصيل حول سرطان المعدة", "أحتاج إلى مزيد من التفاصيل حول سرطان المعدة"],
        "responses": ["بالتأكيد، يؤثر سرطان المعدة على بطانة المعدة. تشمل الأعراض عسر الهضم وفقدان الوزن. قد يتضمن العلاج الجراحة والعلاج الكيميائي والعلاج الموجه. يشمل التشخيص التنظير الداخلي وأخذ خزعة."]
    },

    {
        "tag": "ar_TreatmentFor_LungCancer",
        "patterns": ["أخبرني عن علاجات سرطان الرئة", "ما هي خيارات علاج سرطان الرئة؟", "كيف يتم علاج سرطان الرئة؟"],
        "responses": ["قد يشمل علاج سرطان الرئة الجراحة والعلاج الكيميائي والعلاج الإشعاعي والعلاجات الموجهة. يعتمد الاختيار على مرحلة سرطان الرئة ونوع سرطان الرئة."]
    },
    {
        "tag": "ar_TreatmentFor_ProstateCancer",
        "patterns": ["أخبرني عن علاجات سرطان البروستاتا", "ما هي خيارات علاج سرطان البروستاتا؟", "كيف يتم علاج سرطان البروستاتا؟"],
        "responses": ["قد يتضمن علاج سرطان البروستاتا الجراحة والعلاج الإشعاعي والعلاج الهرموني وأحياناً العلاج الكيميائي. ويعتمد النهج على عوامل مثل مرحلة السرطان ومدى شراسة السرطان."]
    },
    {
        "tag": "ar_TreatmentFor_OvarianCancer",
        "patterns": ["أخبرني عن علاجات سرطان المبيض", "ما هي خيارات علاج سرطان المبيض؟", "كيف يتم علاج سرطان المبيض؟"],
        "responses": ["قد يتضمن علاج سرطان المبيض الجراحة والعلاج الكيميائي والعلاج الموجه. وتعتمد خطة العلاج المحددة على عوامل مثل مرحلة السرطان والحالة الصحية العامة للمريضة."]
    },
    {
        "tag": "ar_TreatmentFor_Leukemia",
        "patterns": ["أخبرني عن علاجات سرطان الدم", "ما هي خيارات علاج سرطان الدم", "كيف يتم علاج سرطان الدم؟"],
        "responses":["قد يتضمن علاج سرطان الدم العلاج الكيميائي والعلاج الموجه والعلاج الإشعاعي وزرع الخلايا الجذعية.يعتمد الاختيار على نوع سرطان الدم وعوامل أخرى."]
    },
    {
        "tag": "ar_TreatmentFor_Lymphoma",
        "patterns": ["أخبرني عن علاجات سرطان الغدد اللمفاوية", "ما هي خيارات علاج سرطان الغدد اللمفاوية", "كيف يتم علاج سرطان الغدد اللمفاوية؟"],
        "responses":["قد يشمل علاج سرطان الغدد اللمفاوية العلاج الكيميائي والعلاج المناعي والعلاج الإشعاعي وأحياناً زراعة الخلايا الجذعية.ويعتمد النهج المحدد على نوع الورم اللمفاوي ومرحلته."]
    },
    {
        "tag": "ar_TreatmentFor_Melanoma",
        "patterns": ["أخبرني عن علاجات الورم الميلانيني", "ما هي خيارات علاج الورم الميلانيني؟", "كيف يتم علاج الورم الميلانيني؟"],
         "responses":["قد يتضمن علاج الميلانوما الجراحة والعلاج المناعي والعلاج الموجه وأحياناً العلاج الكيميائي.يعد الاكتشاف المبكر أمرًا بالغ الأهمية للحصول على علاج أكثر فعالية."]
    },
    {
        "tag": "ar_TreatmentFor_PancreaticCancer",
        "patterns": ["أخبرني عن علاجات سرطان البنكرياس", "ما هي خيارات علاج سرطان البنكرياس؟", "كيف يتم علاج سرطان البنكرياس؟"],
        "responses": ["قد يتضمن علاج سرطان البنكرياس الجراحة والعلاج الكيميائي والعلاج الإشعاعي والعلاج الموجه.يعتمد الاختيار على عوامل مثل مرحلة السرطان وموقعه."]
    },
    {
        "tag": "ar_TreatmentFor_BladderCancer",
        "patterns": ["أخبرني عن علاجات سرطان المثانة", "ما هي خيارات علاج سرطان المثانة؟", "كيف يتم علاج سرطان المثانة؟"],
        "responses": ["قد يتضمن علاج سرطان المثانة الجراحة والعلاج المناعي والعلاج الكيميائي وأحياناً العلاج الإشعاعي. يعتمد النهج على عوامل مثل مرحلة السرطان ودرجته."]
    },
    {
        "tag": "ar_TreatmentFor_KidneyCancer",
        "patterns": ["أخبرني عن علاجات سرطان الكلى", "ما هي خيارات علاج سرطان الكلى؟", "كيف يتم علاج سرطان الكلى؟"],
        "responses": ["قد يتضمن علاج سرطان الكلى الجراحة والعلاج الموجه والعلاج المناعي وأحيانًا العلاج الإشعاعي. ويعتمد الاختيار على عوامل مثل مرحلة سرطان الكلى ونوعه."]
    },
    {
        "tag": "ar_TreatmentFor_LiverCancer",
        "patterns": ["أخبرني عن علاجات سرطان الكبد", "ما هي خيارات علاج سرطان الكبد؟", "كيف يتم علاج سرطان الكبد؟"],
        "responses": ["قد يشمل علاج سرطان الكبد الجراحة والاستئصال والاستئصال والإصمام والعلاج الموجه. ويعتمد الاختيار على عوامل مثل مرحلة السرطان وموقعه."]
    },
    {
        "tag": "ar_TreatmentFor_ThyroidCancer",
        "patterns": ["أخبرني عن علاجات سرطان الغدة الدرقية", "ما هي خيارات علاج سرطان الغدة الدرقية؟", "كيف يتم علاج سرطان الغدة الدرقية؟"],
        "responses": ["قد يتضمن علاج سرطان الغدة الدرقية الجراحة، والعلاج باليود المشع، والعلاج الهرموني، وأحيانًا العلاج الموجه. يعتمد النهج المحدد على عوامل مثل نوع سرطان الغدة الدرقية ومرحلته."]
    },
    {
        "tag": "ar_TreatmentFor_CervicalCancer",
        "patterns": ["أخبرني عن علاجات سرطان عنق الرحم", "ما هي خيارات علاج سرطان عنق الرحم", "كيف يتم علاج سرطان عنق الرحم؟"],
        "responses": ["قد يشمل علاج سرطان عنق الرحم الجراحة والعلاج الإشعاعي والعلاج الكيميائي وأحياناً العلاج الموجه. ويعتمد الاختيار على عوامل مثل مرحلة سرطان عنق الرحم ونوعه."]
    },
    {
        "tag": "ar_TreatmentFor_GastricCancer",
        "patterns": ["أخبرني عن علاجات سرطان المعدة", "ما هي خيارات علاج سرطان المعدة؟", "كيف يتم علاج سرطان المعدة؟"],
        "responses": ["قد يتضمن علاج سرطان المعدة الجراحة والعلاج الكيميائي والعلاج الإشعاعي والعلاج الموجه. ويعتمد الاختيار على عوامل مثل مرحلة السرطان وموقعه."]
    },
    {
        "tag": "ar_LungCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان الرئة", "أخبرني عن الآثار الجانبية لعلاج سرطان الرئة", "ما هي الآثار الجانبية لعلاج سرطان الرئة؟"],
        "responses": ["قد تشمل الآثار الجانبية الشائعة لعلاج سرطان الرئة الإرهاق والغثيان وتساقط الشعر وتغيرات في الشهية وزيادة التعرض للعدوى."]
      },
      {
        "tag": "ar_ProstateCancer_SideEffects",
        "patterns": [ "ما هي الآثار الجانبية لعلاج سرطان البروستاتا", "أخبرني عن الآثار الجانبية لعلاج سرطان البروستاتا", "ما هي الآثار الجانبية لعلاج سرطان البروستاتا؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان البروستاتا ضعف الانتصاب وسلس البول والتعب والتغيرات الهرمونية."]
      },
      {
        "tag": "ar_OvarianCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان المبيض", "أخبرني عن الآثار الجانبية لعلاج سرطان المبيض", "ما هي الآثار الجانبية لعلاج سرطان المبيض؟"],
        "responses": ["ما هي الآثار الجانبية لعلاج سرطان المبيض", "أخبرني عن الآثار الجانبية لعلاج سرطان المبيض", "ما هي الآثار الجانبية لعلاج سرطان المبيض؟"]
      },
      {
        "tag": "ar_Leukemia_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان الدم", "أخبرني عن الآثار الجانبية لعلاج سرطان الدم", "ما هي الآثار الجانبية لعلاج سرطان الدم؟"],
        "responses": ["ما هي الآثار الجانبية لعلاج سرطان الدم", "أخبرني عن الآثار الجانبية لعلاج سرطان الدم", "ما هي الآثار الجانبية لعلاج سرطان الدم؟"]
      },
      {
        "tag": "ar_Lymphoma_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان الغدد اللمفاوية", "أخبرني عن الآثار الجانبية لعلاج سرطان الغدد اللمفاوية", "ما هي الآثار الجانبية لعلاج سرطان الغدد اللمفاوية؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان الغدد اللمفاوية الغثيان والإرهاق وتساقط الشعر وزيادة التعرض للعدوى والتغيرات في تعداد خلايا الدم."]
      },
      {
        "tag": "ar_Melanoma_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج الميلانوما", "أخبرني عن الآثار الجانبية لعلاج الميلانوما", "ما هي الآثار الجانبية لعلاج الميلانوما؟"],
        "responses": [  "قد تشمل الآثار الجانبية لعلاج الميلانوما الإرهاق وردود الفعل الجلدية والغثيان والأعراض الشبيهة بأعراض الإنفلونزا والتغيرات في الشهية."]
      },
      {
        "tag": "ar_PancreaticCancer_SideEffects",
        "patterns": [ "ما هي الآثار الجانبية لعلاج سرطان البنكرياس", "أخبرني عن الآثار الجانبية لعلاج سرطان البنكرياس", "ما هي الآثار الجانبية لعلاج سرطان البنكرياس؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان البنكرياس الغثيان والإرهاق ومشاكل في الجهاز الهضمي وفقدان الوزن وتغيرات في مستويات السكر في الدم."]
      },
      {
        "tag": "ar_BladderCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان المثانة", "أخبرني عن الآثار الجانبية لعلاج سرطان المثانة", "ما هي الآثار الجانبية لعلاج سرطان المثانة؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان المثانة سلس البول والإرهاق والغثيان والتغيرات في الشهية وزيادة التعرض للعدوى."]
      },
      {
        "tag": "ar_KidneyCancer_SideEffects",
        "patterns": [ "ما هي الآثار الجانبية لعلاج سرطان الكلى", "أخبرني عن الآثار الجانبية لعلاج سرطان الكلى", "ما هي الآثار الجانبية لعلاج سرطان الكلى؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان الكلى الإرهاق والغثيان والتغيرات في ضغط الدم وزيادة خطر الإصابة بالعدوى والتغيرات في وظائف الكلى."]
      },
      {
        "tag": "ar_LiverCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان الكبد", "أخبرني عن الآثار الجانبية لعلاج سرطان الكبد", "ما هي الآثار الجانبية لعلاج سرطان الكبد؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان الكبد الإرهاق ومشاكل في الجهاز الهضمي وتغيرات في وظائف الكبد وزيادة خطر الإصابة بالعدوى وتغيرات في تخثر الدم."]
      },
      {
        "tag": "ar_ThyroidCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان الغدة الدرقية", "أخبرني عن الآثار الجانبية لعلاج سرطان الغدة الدرقية", "ما هي الآثار الجانبية لعلاج سرطان الغدة الدرقية؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان الغدة الدرقية الإرهاق والتغيرات في مستويات هرمون الغدة الدرقية والتغيرات في الوزن والتغيرات في الشهية."]
      },
      {
        "tag": "ar_CervicalCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان عنق الرحم", "أخبرني عن الآثار الجانبية لعلاج سرطان عنق الرحم", "ما هي الآثار الجانبية لعلاج سرطان عنق الرحم؟"],
        "responses": [ "قد تشمل الآثار الجانبية لعلاج سرطان عنق الرحم الإرهاق والغثيان والتغيرات في الخصوبة وآلام الحوض والاضطراب العاطفي."]
      },
      {
        "tag": "ar_GastricCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان المعدة", "أخبرني عن الآثار الجانبية لعلاج سرطان المعدة", "ما هي الآثار الجانبية لعلاج سرطان المعدة؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان المعدة الغثيان وتغيرات في الشهية والإرهاق ومشاكل في الجهاز الهضمي وتغيرات في تعداد الدم."]
      },
      {
        "tag": "ar_LungCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان الرئة؟", "أخبرني عن أعراض سرطان الرئة", "كيف يظهر سرطان الرئة؟"],
        "responses": ["تشمل الأعراض الشائعة لسرطان الرئة السعال المستمر وألم الصدر وضيق التنفس والتعب وفقدان الوزن غير المبرر."]
      },
      {
        "tag": "ar_ProstateCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان البروستاتا؟", "أخبرني عن أعراض سرطان البروستاتا", "كيف يظهر سرطان البروستاتا؟"],
        "responses": ["قد تشمل أعراض سرطان البروستاتا صعوبة في التبول ووجود دم في البول أو السائل المنوي وضعف الانتصاب وعدم الراحة في منطقة الحوض."]
      },
      {
        "tag": "ar_OvarianCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان المبيض؟", "أخبرني عن أعراض سرطان المبيض", "كيف يظهر سرطان المبيض نفسه؟"],
        "responses": ["يمكن أن تكون أعراض سرطان المبيض خفية وقد تشمل الانتفاخ وألم الحوض وتغيرات في عادات الأمعاء وكثرة التبول"]
      },
      {
        "tag": "ar_Leukemia_Symptoms",
        "patterns": ["ما هي أعراض سرطان الدم", "أخبرني عن أعراض سرطان الدم", "كيف تظهر أعراض سرطان الدم؟"],
        "responses": ["قد تشمل أعراض ابيضاض الدم (اللوكيميا) الإرهاق وشحوب الجلد والالتهابات المتكررة وفقدان الوزن غير المبرر وسهولة الإصابة بالكدمات أو النزيف."]
      },
      {
        "tag": "ar_Lymphoma_Symptoms",
        "patterns": ["ما هي أعراض سرطان الغدد اللمفاوية", "أخبرني عن أعراض سرطان الغدد اللمفاوية", "كيف تظهر أعراض سرطان الغدد اللمفاوية؟"],
        "responses": ["يمكن أن تشمل أعراض سرطان الغدد اللمفاوية تورم الغدد اللمفاوية والحمى والتعرق الليلي وفقدان الوزن غير المبرر والإرهاق."]
      },
      {
        "tag": "ar_Melanoma_Symptoms",
        "patterns": ["ما هي أعراض الميلانوما", "أخبرني عن أعراض الميلانوما", "كيف تظهر أعراض الميلانوما؟"],
        "responses": ["غالبًا ما تتضمن أعراض الميلانوما تغيرات في الجلد، مثل ظهور شامات جديدة أو تغيرات في حجم أو لون الشامات الموجودة أو الحكة أو الإيلام."]
      },
      {
        "tag": "ar_PancreaticCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان البنكرياس؟", "أخبرني عن أعراض سرطان البنكرياس", "كيف يظهر سرطان البنكرياس نفسه؟"],
        "responses": ["قد تشمل أعراض سرطان البنكرياس ألم البطن واليرقان وفقدان الوزن غير المبرر وفقدان الشهية ومشاكل في الجهاز الهضمي."]
      },
      {
        "tag": "ar_BladderCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان المثانة؟", "أخبرني عن أعراض سرطان المثانة", "كيف يظهر سرطان المثانة؟"],
        "responses": ["قد تشمل أعراض سرطان المثانة وجود دم في البول، وكثرة التبول، والألم أثناء التبول، وآلام أسفل الظهر."]
      },
      {
        "tag": "ar_KidneyCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان الكلى", "أخبرني عن أعراض سرطان الكلى", "كيف يظهر سرطان الكلى؟"],
        "responses": ["قد تشمل أعراض سرطان الكلى وجود دم في البول، وألم مستمر في الجانب، وكتل أو كتلة في البطن، وفقدان الوزن غير المبرر."]
      },
      {
        "tag": "ar_LiverCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان الكبد", "أخبرني عن أعراض سرطان الكبد", "كيف يظهر سرطان الكبد؟"],
        "responses": ["يمكن أن تشمل أعراض سرطان الكبد الشعور بألم أو انزعاج في البطن، واليرقان، وفقدان الوزن غير المبرر، وتورم في البطن."]
      },
      {
        "tag": "ar_ThyroidCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان الغدة الدرقية؟", "أخبرني عن أعراض سرطان الغدة الدرقية", "كيف يظهر سرطان الغدة الدرقية نفسه؟"],
        "responses": ["قد تشمل أعراض سرطان الغدة الدرقية وجود كتلة في الرقبة وتغيرات في الصوت وصعوبة في البلع وألم مستمر في الرقبة."]
      },
      {
        "tag": "ar_CervicalCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان عنق الرحم؟", "أخبرني عن أعراض سرطان عنق الرحم", "كيف يظهر سرطان عنق الرحم؟"],
        "responses": ["قد تشمل أعراض سرطان عنق الرحم نزيف مهبلي غير طبيعي وألم في الحوض وألم أثناء الجماع وتغيرات في أنماط الدورة الشهرية."]
      },
      {
        "tag": "ar_GastricCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان المعدة", "أخبرني عن أعراض سرطان المعدة", "كيف يظهر سرطان المعدة نفسه؟"],
        "responses": ["يمكن أن تشمل أعراض سرطان المعدة عسر الهضم، وعدم الراحة في البطن، وفقدان الوزن غير المبرر، ووجود دم في البراز."]
      },
      {
        "tag": "ar_BreastCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان الثدي", "أخبريني عن أعراض سرطان الثدي", "ما هي علامات سرطان الثدي؟"],
        "responses": ["تشمل الأعراض الشائعة لسرطان الثدي وجود كتلة في الثدي، وتغيرات في حجم الثدي أو شكله، وتغيرات في الحلمة، وألم في الثدي، وتغيرات في الجلد."]
      },
      {
        "tag": "ar_ColorectalCancer_Symptoms",
        "patterns": ["ما هي أعراض سرطان القولون والمستقيم", "أخبرني عن أعراض سرطان القولون والمستقيم", "ما هي علامات سرطان القولون والمستقيم؟"],
        "responses": ["قد تشمل أعراض سرطان القولون والمستقيم تغيرات في عادات الأمعاء، ووجود دم في البراز، وألم في البطن، وفقدان الوزن غير المبرر، والإرهاق."]
      },
      {
        "tag": "ar_BreastCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان الثدي", "أخبرني عن الآثار الجانبية لعلاج سرطان الثدي", "ما هي الآثار الجانبية لعلاج سرطان الثدي؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان الثدي الإرهاق والغثيان وتساقط الشعر وتغيرات في الشهية وزيادة التعرض للعدوى."]
      },
      {
        "tag": "ar_ColorectalCancer_SideEffects",
        "patterns": ["ما هي الآثار الجانبية لعلاج سرطان القولون والمستقيم", "أخبرني عن الآثار الجانبية لعلاج سرطان القولون والمستقيم", "ما هي الآثار الجانبية لعلاج سرطان القولون والمستقيم؟"],
        "responses": ["قد تشمل الآثار الجانبية لعلاج سرطان القولون والمستقيم الإرهاق ومشاكل في الجهاز الهضمي والغثيان وتغيرات في الشهية وزيادة التعرض للعدوى."]
      },

    {"tag": "ar_FoodAvoid",
    "patterns":["ما هي الأطعمة التي يجب تجنبها",
    "ما هي الأطعمة الضارة لتناولها",
    "الأطعمة الخطرة التي يجب تناولها",
    "ما هي الأطعمة التي يجب أن أتجنبها من أجل صحة أفضل؟",
    "هل هناك أطعمة محددة يجب أن أقلل منها أو أستبعدها من نظامي الغذائي؟",
    "هل يمكنك اقتراح بدائل للوجبات الخفيفة غير الصحية أو الأطعمة المصنعة؟"],
    "responses":["أطعمة مثل اللحوم المصنعة، واللحوم الحمراء، والأطعمة والمشروبات السكرية، والأطعمة عالية المعالجة، والكحول، والأطعمة السريعة والأطعمة المقلية، والأطعمة التي تحتوي على ملح زائد. بدلاً من التركيز فقط على الأطعمة التي يجب تجنبها، من الضروري التركيز على نظام غذائي متوازن ومتنوع. شجع على تناول مجموعة كبيرة من الفواكه والخضروات والحبوب الكاملة والبروتينات الخالية من الدهون والدهون الصحية. هذه الأطعمة غنية بالمغذيات الأساسية ومضادات الأكسدة والألياف، وهي مفيدة للصحة العامة وقد تساعد في تقليل خطر الإصابة ببعض أنواع السرطان."],
    "context": ["diet"]
    },
    {"tag": "ar_FoodEat",
    "patterns":["ما هي الأطعمة التي يجب تناولها",
    "ما هي الأطعمة الجيدة للأكل",
    "الأطعمة الآمنة لتناولها",
    "ما الأطعمة التي يجب أن أدرجها في نظامي الغذائي؟",
    "هل يمكنك اقتراح خطة أكل صحية؟",
    "هل هناك نظام غذائي قد يساعد في تقليل خطر الإصابة بأمراض معينة مثل السرطان؟"
],
    "responses":["الأطعمة مثل الفواكه والخضروات والحبوب الكاملة ومصادر البروتين الخالية من الدهون والدهون الصحية والألبان قليلة الدسم أو بدائل الألبان والأعشاب والتوابل والشاي وأخيراً وليس آخراً الماء. <br>تذكر أن النظام الغذائي المتوازن والمتنوع الذي يتضمن مجموعة واسعة من الأطعمة الغنية بالعناصر الغذائية هو المفتاح. ضع في اعتبارك أيضًا: التحكم في الحصص الغذائية، والحد من الأطعمة المصنعة، والحفاظ على وزن صحي والحفاظ على النشاط"] 
  },
    {"tag": "ar_Contagious",
        "patterns":["هل السرطان معدٍ؟",
        "هل من الممكن أن تنتقل عدوى السرطان من شخص آخر؟",
        "هل من الممكن أن ينتقل السرطان للآخرين مثل الأمراض المعدية؟",
        "هل يمكن أن أصاب بالسرطان من خلال التواجد حول شخص مصاب به؟",
        "هل هناك خطر الإصابة بالسرطان من خلال المخالطة العرضية؟"
      
],
    "responses":["لا، السرطان في حد ذاته ليس معدياً.السرطان هو مرض ناجم عن النمو غير المنضبط للخلايا غير الطبيعية في الجسم وانتشارها.وهو يتطور بسبب تفاعل معقد من العوامل الوراثية والبيئية ونمط الحياة. على عكس الأمراض المعدية التي تسببها الفيروسات أو البكتيريا أو مسببات الأمراض الأخرى التي يمكن أن تنتقل من شخص لآخر، لا يمكن أن ينتقل السرطان إلى الآخرين من خلال الاتصال العادي، مثل العناق أو التقبيل أو مشاركة الأواني. ومع ذلك، هناك عوامل معدية معينة، مثل بعض الفيروسات (مثل فيروس الورم الحليمي البشري وفيروسات التهاب الكبد B و C) والبكتيريا (مثل بكتيريا الملوية البوابية)، التي من المعروف أنها تزيد من خطر الإصابة بأنواع معينة من السرطان."]
    },
    {"tag": "ar_TreatmentCost",
    "patterns":["كم تبلغ تكلفة العلاج",
    "ما هي تكلفة علاج سرطان القولون والمستقيم عادةً في قطر؟",
    "هل يمكنك تقديم تقدير لتكاليف علاج سرطان الثدي في قطر؟",
    "ما هي التكاليف المتوقعة لعلاج سرطان القولون والمستقيم وسرطان الثدي في قطر؟"],
    "responses":["إن تكاليف علاج سرطان القولون والمستقيم وسرطان الثدي في قطر، إذا كان لديك بطاقة صحية سارية المفعول، فإن الخدمات التي تقدمها جمعية السرطان القطرية مجانية. ولكن خارج قطر يمكن أن تكون مكلفة للغاية"]
    },
    {"tag": "ar_Hereditary",
    "patterns":["هل يمكن أن ينتقل السرطان عبر الأجيال في العائلات؟",
"هل هناك عنصر وراثي لخطر الإصابة بالسرطان؟",
"ما مدى احتمالية توارث السرطان في العائلات؟",
"هل وجود أحد أفراد العائلة مصاب بالسرطان يزيد من خطر الإصابة بالسرطان؟",
"ما مدى أهمية التاريخ العائلي في تحديد خطر الإصابة بالسرطان؟",
"هل يجب أن أقلق بشأن خطر الإصابة بالسرطان إذا لم يكن أحد أفراد عائلتي مصابًا بالسرطان؟"],
    "responses":["بالتأكيد، يمكن أن يكون لأنواع معينة من السرطان عنصر وراثي، مما يعني أن خطر الإصابة بالسرطان يمكن أن يتأثر بالعوامل الوراثية المتوارثة داخل العائلات. وفي حين لا تكون جميع أنواع السرطان وراثية، إلا أن بعض الأفراد قد يكون لديهم استعداد أكبر للإصابة ببعض أنواع السرطان بسبب طفرات جينية موروثة من آبائهم.",
    "يمكن أن تلعب الجينات الوراثية بالفعل دوراً في خطر الإصابة بالسرطان من خلال المساهمة في متلازمات السرطان الوراثية أو التكتل العائلي لحالات السرطان داخل سلالة العائلة. عندما يكون لدى عائلة ما تاريخ مرضي للإصابة بسرطانات معينة، خاصةً إذا كان العديد من الأقارب المقربين عبر الأجيال قد أصيبوا بنفس أنواع السرطان أو أنواع السرطان ذات الصلة (مثل سرطان الثدي أو المبيض أو القولون والمستقيم أو البروستاتا)، فقد يشير ذلك إلى وجود صلة وراثية.",
    "من المهم أن نلاحظ أن وجود تاريخ عائلي للإصابة بالسرطان لا يعني بالضرورة أن الفرد سيصاب بالسرطان. ومع ذلك، قد يزيد من خطر الإصابة بالسرطان مقارنةً بشخص ليس لديه تاريخ عائلي من هذا القبيل. كما تساهم عوامل أخرى مثل التعرض البيئي وخيارات نمط الحياة والصدفة في خطر الإصابة بالسرطان."]
    },
    {"tag": "ar_Hair",
    "patterns":["هل يمكن أن تتسبب علاجات السرطان لسرطان القولون والمستقيم أو سرطان الثدي في تساقط الشعر؟",
    "هل تساقط الشعر من الآثار الجانبية الشائعة للعلاج الكيميائي لسرطان القولون والمستقيم أو سرطان الثدي؟", "ما هي احتمالات تساقط الشعر أثناء علاج السرطان؟"
],
    "responses":["يمكن بالفعل أن يؤدي كل من سرطان القولون والمستقيم وعلاجات سرطان الثدي، وخاصة العلاج الكيميائي، إلى تساقط الشعر كأثر جانبي. يمكن أن يختلف تأثير العلاج الكيميائي على تساقط الشعر بين الأفراد ويعتمد أيضاً على الأدوية المحددة المستخدمة في نظام العلاج. وبالإضافة إلى العلاج الكيميائي، قد تتسبب علاجات السرطان الأخرى مثل العلاج الإشعاعي أو بعض العلاجات المستهدفة في ترقق الشعر أو تساقطه، على الرغم من أن هذه الآثار قد لا تكون منتشرة على نطاق واسع كما هو الحال مع العلاج الكيميائي. بعد الانتهاء من علاج السرطان، يبدأ الشعر عادةً في النمو مرة أخرى. يبدأ نمو الشعر عادةً في غضون بضعة أسابيع إلى بضعة أشهر بعد الانتهاء من العلاج الكيميائي. ومع ذلك، قد يكون للشعر الذي يُعاد نموه في البداية ملمس أو لون مختلف عما كان عليه قبل العلاج، على الرغم من أن هذا عادةً ما يعود إلى طبيعته مع مرور الوقت."]
    },
    {"tag": "ar_ContactInfo",
    "patterns":["كيف يمكنني التواصل مع أخصائيي علاج السرطان في قطر؟",
    "هل يمكنك توفير تفاصيل الاتصال بمراكز علاج السرطان في قطر؟",
    "مع من يمكنني التحدث عن خيارات رعاية مرضى السرطان في قطر؟",
    "أين يمكنني العثور على معلومات حول مجموعات دعم مرضى السرطان في قطر؟",
    "كيف يمكنني الحصول على خدمات فحص السرطان في قطر؟",
    "هل يمكنك إرشادي إلى المنظمات التي تساعد مرضى السرطان في قطر؟",
    "من هي الجهات التي يجب أن أتواصل معها للحصول على المشورة بشأن تشخيص السرطان وعلاجه في قطر؟",
    "أين يمكنني الحصول على معلومات عن مبادرات أبحاث السرطان في قطر؟",
    "كيف يمكنني التواصل مع أخصائيي الرعاية الصحية المتخصصين في علاج الأورام في قطر؟",
    "هل لديك تفاصيل حول الخدمات المتعلقة بالسرطان المتوفرة في قطر؟"],
    "responses":["في قطر، إذا كنت أنت أو أي شخص تعرفه بحاجة إلى مساعدة أو معلومات تتعلق بالسرطان، فهناك العديد من الجهات والمنظمات التي يمكنها تقديم الدعم والتوجيه والمساعدة الطبية. إليك بعضها:<br>مؤسسة حمد الطبية<br>المركز الوطني لعلاج وأبحاث السرطان (NCCCR)<br>مجموعات دعم مرضى السرطان<br>أخصائيو الرعاية الصحية<br>وزارة الصحة العامة (MoPH)<br>من المهم ملاحظة أن معلومات الاتصال المحددة والخدمات المقدمة والموارد المتاحة قد تختلف. يمكن أن يساعدك الاتصال بمؤسسات الرعاية الصحية مباشرةً أو زيارة مواقعها الإلكترونية الرسمية في الحصول على معلومات دقيقة ومحدثة بشأن الخدمات والدعم المتعلق بالسرطان في قطر."]
    },
    {"tag": "ar_BadEff",
    "patterns":["ما هي الآثار الجسدية المترتبة على الإصابة بالسرطان؟",
    "هل يمكنك شرح الآثار الجانبية لعلاجات السرطان؟",
    "ما تأثير السرطان على الصحة النفسية للشخص؟",
    "هل هناك مضاعفات محددة مرتبطة بأنواع مختلفة من السرطان؟",
    "كيف يؤثر السرطان على الحياة اليومية والأنشطة اليومية؟",
    "هل يمكنك وصف الآثار طويلة المدى للنجاة من السرطان؟",
    "ما هي مخاطر الإصابة بحالات ثانوية بعد علاج السرطان؟",
    "هل تؤدي علاجات السرطان إلى أي مشاكل صحية دائمة؟",
    "كيف تؤثر مرحلة السرطان على تأثيره على الجسم؟",
    "هل يمكنك مناقشة الآثار الاجتماعية والمالية المترتبة على التعامل مع السرطان؟"],
    "responses":["يمكن أن يكون للسرطان مجموعة من التأثيرات السلبية على الجسم والصحة العامة والرفاهية العاطفية. تتضمن بعض الآثار أو العواقب السلبية الشائعة للسرطان ما يلي: الآثار البدنية، والتأثيرات العاطفية والنفسية، والآثار الجانبية للعلاج: التعب والضعف، والغثيان والقيء أو الإسهال، وتساقط الشعر، وزيادة التعرض للعدوى، ومشاكل الجلد أو تغيراته"]
    },
    {"tag": "ar_Reoccur",
    "patterns":["ما مدى احتمالية عودة سرطان القولون والمستقيم بعد العلاج؟",
    "هل يمكن أن يعود سرطان الثدي بعد العلاج؟",
    "ما هي احتمالات عودة الإصابة بسرطان القولون والمستقيم للناجين من سرطان القولون والمستقيم؟",
    "هل هناك علامات أو أعراض تشير إلى عودة سرطان الثدي؟",
    "كم مرة يجب عليَّ إجراء فحوصات المتابعة بعد العلاج من سرطان القولون والمستقيم؟",
    "ما العوامل التي تساهم في تكرار الإصابة بسرطان الثدي؟",
    "هل يمكن أن يكون سرطان القولون والمستقيم النقيلي عودة للسرطان الأصلي؟",
    "هل هناك علاجات محددة لمنع تكرار الإصابة بسرطان القولون والمستقيم؟",
    "ما الخطوات التي يمكنني اتخاذها لتقليل خطر تكرار الإصابة بسرطان الثدي؟",
    "هل هناك فرصة أكبر لتكرار الإصابة بسرطان القولون والمستقيم إذا تم تشخيص سرطان القولون والمستقيم الأصلي أو سرطان الثدي في مرحلة لاحقة؟"],
    "responses":["يمكن أن تتكرر الإصابة بسرطان القولون والمستقيم وسرطان الثدي على حد سواء، مما يعني أنه يمكن أن يعود بعد العلاج الأولي. يمكن أن تحدث العودة موضعيًا في نفس منطقة السرطان الأصلي أو تنتقل إلى أجزاء أخرى من الجسم.<br>تكرار الإصابة بسرطان القولون والمستقيم:<br><br>قد يحدث ارتداد سرطان القولون والمستقيم في منطقة الأمعاء حيث كان الورم الأصلي أو في العقد اللمفاوية القريبة.<br>كما يمكن أن يتكرر في أعضاء بعيدة، مثل الكبد أو الرئتين، مثل سرطان القولون والمستقيم النقيلي.<br>تعد الرعاية المنتظمة للمتابعة مع الفحوصات والمراقبة ضرورية لاكتشاف أي علامات لعودة المرض.<br>تكرار الإصابة بسرطان الثدي:<br><br>يمكن أن تتكرر الإصابة بسرطان الثدي في منطقة الثدي حيث تم علاج الورم الأصلي أو في العقد اللمفاوية.<br>كما يمكن أن ينتقل إلى أعضاء بعيدة مثل العظام أو الرئتين أو الكبد أو الدماغ.<br>يختلف خطر التكرار بناءً على عوامل مثل النوع الفرعي للسرطان والمرحلة التي وصل إليها السرطان عند التشخيص والعلاج الذي تم تلقيه والعوامل الفردية.<br>تُعد متابعة الرعاية من خلال الفحوصات الروتينية والتصوير الشعاعي للثدي بالأشعة السينية وغيرها من الفحوصات أمراً بالغ الأهمية للكشف عن أي علامات على عودة الإصابة بالسرطان.<br>يمكن أن يؤدي الاكتشاف المبكر للسرطان المتكرر إلى المزيد من خيارات العلاج ونتائج أفضل."]
    },
    {"tag": "ar_AssistanceGov",
    "patterns":["ما هي خدمات الرعاية الصحية المتوفرة في قطر لمرضى السرطان؟",
    "هل هناك برامج مساعدة مالية لعلاج السرطان في قطر؟",
     "كيف يمكنني الحصول على علاج السرطان الذي تغطيه برامج الرعاية الصحية القطرية؟",
     "هل تشمل البرامج الصحية الحكومية القطرية مبادرات الوقاية من السرطان؟"],
    "responses":["تقدم مؤسسة الرعاية الصحية الأولية المعلومات والمساعدة فيما يتعلق ببرامج الدعم المالي، فهي تقدم مجموعة واسعة من الخدمات بما في ذلك التشخيص والعلاج والرعاية الداعمة لمختلف أنواع السرطانات."]
    },
    {"tag": "ar_EffOnBrain",
    "patterns":["كيف يؤثر سرطان القولون والمستقيم على الدماغ؟",
    "هل يمكن أن ينتشر سرطان القولون والمستقيم إلى الدماغ؟",
    "ما هي علامات إصابة الدماغ بسرطان القولون والمستقيم؟",
    "هل ينتشر سرطان الثدي عادةً إلى الدماغ؟",
    "ما هي الأعراض التي تشير إلى وجود نقائل دماغية لدى مرضى سرطان الثدي؟",
    "هل هناك علاجات محددة لنقائل الدماغ من سرطان القولون والمستقيم؟"],
    "responses":["من المحتمل أن يؤثر كل من سرطان القولون والمستقيم وسرطان الثدي على الدماغ، وذلك من خلال النقائل في المقام الأول، حيث تنتشر الخلايا السرطانية من موقعها الأصلي إلى الدماغ. يمكن أن تختلف التأثيرات على الدماغ بناءً على عدة عوامل، بما في ذلك مرحلة السرطان والعلاج والحالة الصحية للفرد."]
    },
    {"tag": "ar_DevelopmentOfCancer",
    "patterns":["هل يمكنك أن تشرح لي كيف يتطور السرطان ولماذا لا يكون معدياً؟",
    "أريد أن أفهم لماذا لا يمكن للسرطان أن ينتشر كالأمراض المعدية؟",
    "ما هي العوامل التي تساهم في تطور السرطان، ولماذا لا يكون معدياً؟"],
    "responses":["بالتأكيد! يتطور السرطان عندما تتعرض الخلايا الطبيعية في الجسم لتغيرات أو طفرات جينية في الجسم تؤدي إلى نموها وانقسامها بشكل لا يمكن السيطرة عليه. يمكن أن تحدث هذه التغييرات بسبب عوامل مختلفة مثل المشاكل الوراثية والتعرض للعوامل المسببة للسرطان (مثل دخان التبغ أو الأشعة فوق البنفسجية أو بعض المواد الكيميائية) وعادات نمط الحياة غير الصحية، وأحيانًا العدوى مثل بعض الفيروسات أو البكتيريا. ومع ذلك، من المهم أن نلاحظ أنه في حين أن العدوى مثل بعض الفيروسات (مثل فيروس الورم الحليمي البشري) يمكن أن تزيد من خطر الإصابة بأنواع معينة من السرطان، فإن السرطان نفسه ليس معديًا بشكل مباشر."]
    },
    {"tag": "ar_LengthOfTreatment",
    "patterns":["ما المدة التي يستغرقها علاج سرطان القولون والمستقيم وسرطان الثدي عادةً؟",
    "هل يمكنك تقديم تقدير لمدة علاج سرطان القولون والمستقيم وسرطان الثدي؟",
    "ما هو متوسط المدة الزمنية لعلاج سرطان القولون والمستقيم أو سرطان الثدي؟"],
    "responses":["لسرطان القولون والمستقيم:<br>الجراحة: قد تختلف مدة جراحة استئصال سرطان القولون والمستقيم ولكنها تستغرق عادةً بضع ساعات. قد تستمر فترة النقاهة في المستشفى من عدة أيام إلى أسبوع أو أكثر، اعتمادًا على مدى تعقيد العملية.<br>العلاج الكيميائي: تختلف مدة العلاج الكيميائي، وعادةً ما تمتد من عدة أسابيع إلى أشهر. قد يتضمن دورات مع فترات من العلاج تليها فترات راحة للتعافي.<br>العلاج الإشعاعي: يمكن أن تتراوح مدة العلاج الإشعاعي أيضًا من بضعة أسابيع إلى عدة أسابيع، اعتمادًا على نوع الإشعاع وخطة العلاج.<br>لسرطان الثدي:<br>الجراحة: يمكن أن تختلف مدة جراحة سرطان الثدي، مثل استئصال الورم أو استئصال الثدي، من بضع ساعات إلى يوم واحد. قد تمتد فترة النقاهة في المستشفى من يوم إلى بضعة أيام أو أكثر، بناءً على الإجراء الجراحي والتعافي الفردي.<br>العلاج الكيميائي: عادةً ما يستمر العلاج الكيميائي لعدة أسابيع إلى شهور، مع وجود فترات بين الدورات حتى يتعافى الجسم.<br>العلاج الإشعاعي: غالبًا ما تمتد مدة العلاج الإشعاعي لسرطان الثدي لعدة أسابيع، مع جلسات يومية في أيام الأسبوع لفترة محددة."]
    },




    
    {"tag":"MenCancer",
    "patterns":["هل يمكن أن يصاب الرجال بسرطان الثدي؟",
    "ما هي أعراض سرطان الثدي لدى الرجال؟",
    "هل هناك عوامل خطر لإصابة الرجال بسرطان الثدي؟",
    "ماذا يجب أن يفعل الرجال إذا لاحظوا تغيرات في أنسجة الثدي لديهم؟"],
    "responses":["نعم، يمكن أن يُصاب الرجال بسرطان الثدي، على الرغم من أنه أقل شيوعاً من النساء. يحدث سرطان الثدي لدى الرجال عندما تتكون خلايا خبيثة في أنسجة الثدي. لدى الرجال كمية صغيرة من أنسجة الثدي خلف حلمتي الثدي، مما يعني أنهم عرضة للإصابة بسرطان الثدي، على الرغم من أنه نادر نسبياً مقارنة بالنساء."]
    },
    {"tag":"Animal",
    "patterns":["هل يمكن أن تصاب الحيوانات بسرطان الثدي؟",
    "ما هي أعراض سرطان الثدي لدى الحيوانات؟",
    "هل هناك عوامل خطر لإصابة الحيوانات بسرطان الثدي؟"],
    "responses":["نعم، يمكن أن تصاب الحيوانات بسرطان الثدي، الذي يشار إليه باسم أورام الغدة الثديية. إن إناث الكلاب والقطط، وخاصة بعض السلالات، معرضة للإصابة به. التعقيم قبل الدورة الحرارية الأولى يقلل بشكل كبير من الخطر. "]
    },
    {"tag":"StagesOfCancer",
    "patterns":["ماذا يعني أن يكون سرطان الثدي في المرحلة 0؟",
    "هل يمكنك شرح الفروق بين المرحلة الأولى والمرحلة الثانية من سرطان الثدي؟",
    "ما هي معايير اعتبار سرطان الثدي في المرحلة الثالثة؟",
    "كيف يتم تحديد مرحلة سرطان الثدي وتشخيصه؟",
    "هل يمكن أن يتطور سرطان الثدي من مرحلة إلى أخرى؟"],
    "responses":["المرحلة 0 (السرطان الموضعي): في هذه المرحلة، تكون الخلايا الشاذة محصورة داخل القنوات (سرطان الأقنية الموضعي (DCIS) أو الفصيصات (سرطان فصيصيصي موضعي (LCIS)) في الثدي ولم تغزو الأنسجة المحيطة.<br>المرحلة الأولى: تنطوي هذه المرحلة على سرطان الثدي الغازي، حيث يصل طول الورم إلى 2 سم ولم ينتشر خارج الثدي.<br><br>المرحلة الثانية: تنقسم المرحلة الثانية إلى فئتين فرعيتين :<br><br>المرحلة IIA: يبلغ قياس الورم 2-5 سنتيمترات وقد يكون الورم قد انتشر أو لم ينتشر إلى العقد اللمفاوية القريبة.<br>المرحلة IIB: يكون الورم أكبر (5 سنتيمترات أو أكثر) ولكن لم ينتشر إلى العقد اللمفاوية أو أصغر ولكنه انتشر إلى العقد اللمفاوية القريبة.<br>المرحلة الثالثة: تُعرف أيضاً بسرطان الثدي المتقدم موضعياً، وتنقسم هذه المرحلة إلى:<br><br>المرحلة الثالثة أ: يكون الورم أكبر حجماً وقد يشمل الأنسجة المحيطة وقد يكون قد انتشر إلى العُقَد اللمفاوية.<br>المرحلة الثالثة ب: قد يكون السرطان قد غزا البنى القريبة مثل جدار الصدر أو الجلد وقد يكون قد انتشر إلى العقد اللمفاوية.<br>المرحلة IIIC: انتشر السرطان على نطاق واسع إلى العُقَد اللمفاوية، وقد يشمل المزيد من العُقَد أو العُقَد القريبة من الترقوة أو عظمة الصدر.<br>المرحلة الرابعة: هذه هي المرحلة الأكثر تقدماً، وتشير إلى أن السرطان قد انتشر (انتشر) إلى أعضاء أو أنسجة بعيدة، مثل الرئتين أو الكبد أو العظام أو الدماغ."]
    },
    {"tag":"GPUK",
    "patterns":["ما هو الممارس العام في المملكة المتحدة"],
    "responses":["\"الممارس العام في المملكة المتحدة\" يشير عادةً إلى الممارس العام في المملكة المتحدة. الممارس العام (GP) هو طبيب رعاية أولية يقدم الرعاية الطبية الأساسية للمرضى، ويشخص الحالات الصحية المختلفة، ويقدم الرعاية الوقائية، ويدير الأمراض المزمنة، ويحيل المرضى إلى الأخصائيين أو المستشفيات عند الضرورة."]
    },
    {"tag":"NHS",
    "patterns":["ما هي الخدمات الصحية الوطنية؟"],
    "responses":["NHS هي اختصار لـ\"الخدمة الصحية الوطنية\"، وهي نظام الرعاية الصحية الممول من القطاع العام في المملكة المتحدة. تأسست الخدمة الصحية الوطنية في عام 1948، وتوفر خدمات الرعاية الصحية الشاملة لسكان المملكة المتحدة، وتقدم الرعاية الطبية المجانية عند الاستخدام وتمويلها بشكل أساسي من خلال الضرائب."]
    },
    {"tag":"SymptomsCancer",
    "patterns":["ما هي العلامات التحذيرية الشائعة للإصابة بالسرطان؟",
    "هل يمكنكِ شرح الأعراض المبكرة لسرطان الثدي؟",
    "هل يمكنك شرح الأعراض التي قد تشير إلى سرطان الدماغ؟",
    "ماذا يجب أن أفعل إذا لاحظت علامات محتملة للإصابة بالسرطان؟",
    "هل تشير أعراض معينة إلى ارتفاع خطر الإصابة بسرطان القولون والمستقيم؟"],
    "responses":["تتضمن بعض العلامات العامة التي قد تشير إلى وجود سرطان ما يلي: فقدان غير مبرر للوزن، تغيرات في عادات الأمعاء أو المثانة، التعب المستمر، كتل أو مناطق سميكة، تغيرات في الجلد، سعال أو بحة في الصوت، ألم، تغيرات في الشامات أو الآفات الجلدية"]
    },
    {"tag":"Conclusion",
    "patterns":["الخاتمة"],
    "responses":["سرطان القولون والمستقيم وسرطان الثدي هما نوعان من السرطانات المنتشرة التي تؤثر بشكل كبير على حياة الأفراد في جميع أنحاء العالم . يتميز كلا النوعين من السرطان بخصائصهما المميزة، حيث يؤثران على أجزاء مختلفة من الجسم ولهما عوامل خطر وأساليب علاج مختلفة. <br>وفي الختام، من الضروري زيادة الوعي حول العلامات وعوامل الخطر وأهمية الكشف المبكر عن سرطان القولون والمستقيم وسرطان الثدي. إن تشجيع خيارات نمط الحياة الصحي، والدعوة إلى إجراء فحوصات منتظمة، ودعم الأبحاث المستمرة، وضمان الوصول إلى خدمات الرعاية الصحية الشاملة هي خطوات حاسمة في مكافحة هذه السرطانات وتحسين نتائج المرضى."]
    },
    {"tag":"OthernamesCC",
    "patterns":["أسماء أخرى لسرطان القولون والمستقيم"],
    "responses":["سرطان الأمعاء، سرطان القولون، سرطان المستقيم، سرطان المستقيم، سرطان الأمعاء، سرطان القولون والمستقيم، سرطان الأمعاء الغليظة، سرطان الجهاز الهضمي السفلي"]
    },
    {"tag":"OthernamesBC",
    "patterns":["أسماء أخرى لسرطان الثدي"],
    "responses":["سرطان الثدي، وسرطان الثدي، وسرطان الثدي، وسرطان الثدي الخبيث، وسرطان الثدي، وسرطان الثدي، وسرطان الغدة الثديية، وسرطان الأقنية الغازية (نوع شائع من سرطان الثدي)، وسرطان الفصيص الغازي (نوع آخر شائع من سرطان الثدي)"]
    },
    {"tag":"MelanomaMen",
    "patterns":["ما هي مناطق الجسم الأكثر عرضة للإصابة بسرطان الجلد لدى الرجال؟",
    "هل هناك مناطق محددة في الجسم يكثر فيها وجود سرطان الجلد عند الذكور؟",
     "هل يمكنك توضيح أي أجزاء من الجسم يجب على الرجال أن يولوا اهتمامًا إضافيًا لسرطان الجلد عند الرجال؟",
     "ما هي المناطق الأكثر شيوعًا للإصابة بسرطان الجلد لدى الرجال؟"],
    "responses":["يحدث الورم الميلانيني في المقام الأول على الجلد، ولكن يمكن أن يتطور أيضًا في أجزاء أخرى من الجسم التي تحتوي على خلايا منتجة للصبغة تسمى الخلايا الصبغية. في حين أن الأورام الميلانينية الجلدية هي الأكثر شيوعًا، يمكن أن يحدث الورم الميلانيني في مناطق مختلفة، والمعروفة باسم المواقع خارج الجلد أو غير الجلدية. تشمل هذه المواقع الأقل شيوعًا التي يمكن أن ينشأ فيها الورم الميلانيني ما يلي : العيون (الميلانوما العينية)، والأغشية المخاطية، والأظافر (الميلانوما تحت اللسان)، والأعضاء الداخلية (الميلانوما الحشوية).    في الرجال، يكون الموقع الأكثر شيوعًا لورم الميلانوما عند الرجال عادةً هو الجذع، والذي يشمل الصدر والظهر. يمكن أن يتطور الميلانوما في أي جزء من الجسم، ولكن بالنسبة للرجال، غالباً ما يكون الجذع (الجذع) هو المكان الذي غالباً ما توجد فيه الأورام الميلانينية. ويشمل ذلك مناطق مثل الظهر والكتفين والصدر."]
    },
    {"tag":"AdvantagesOfThisAI",
    "patterns":["ما هي مزايا هذا التطبيق مقارنةً بتطبيق GPT",
    "ما هي مزايا هذا التطبيق مقارنةً بتطبيق ChatGPT"],
    "responses":["إن تطبيق ChatGPT قوي بالفعل ولكن هذا التطبيق مصمم لتزويدك بالمعلومات المتعلقة بالسرطان."]},
    {"tag":"Pain",
    "patterns":["هل السرطان مؤلم؟"],
    "responses":["يمكن أن يرتبط السرطان بالألم ولكنه يختلف. يعاني البعض من الألم بسبب الأورام أو العلاجات. استشيري الرعاية الصحية للحصول على الدعم الشخصي."]},
    {"tag":"Common",
    "patterns":["لماذا السرطان شائع جداً"],
    "responses":["يتأثر السرطان بعوامل مثل الجينات الوراثية ونمط الحياة والتعرض البيئي، مما يؤدي إلى نمو الخلايا بشكل غير منضبط. الوقاية والكشف المبكر أمران حاسمان."]},
    {"tag":"Carcinogens",
    "patterns":["المواد المسرطنة للسرطان"],
    "responses":["تتضمن بعض عوامل خطر الإصابة بسرطان القولون والمستقيم ما يلي:<br>العمر (يزداد الخطر مع التقدم في العمر)<br>التاريخ العائلي للإصابة بسرطان القولون والمستقيم<br>أمراض الأمعاء الالتهابية (مثل داء كرون والتهاب القولون التقرحي)<br>المتلازمات الوراثية (مثل متلازمة لينش)<br>النظام الغذائي الغني باللحوم الحمراء والمصنعة<br>قلة النشاط البدني<br>السمنة المفرطة<br>التدخين<br>الإفراط في تناول الكحوليات<br>يمكن أن يساعد الحد من هذه العوامل في تقليل خطر الإصابة بسرطان القولون والمستقيم. الفحوصات المنتظمة ضرورية للكشف المبكر."]},
    {"tag":"Tested",
    "patterns":["أين يمكنك إجراء فحص السرطان في قطر؟"],
    "responses":["في قطر، يمكنك إجراء فحص السرطان في المرافق الطبية مثل:<br>مستشفيات مؤسسة حمد الطبية<br>سدرة للطب<br>وحدة الفحص المتنقلة التابعة لجمعية الهلال الأحمر القطري<br>المستشفيات والعيادات الخاصة<br>اتصل بمقدمي الرعاية الصحية "]},
    {"tag":"Remedies",
    "patterns":["العلاجات الطبيعية للسرطان"],
    "responses":["العلاجات الطبيعية ليست بدائل مثبتة لعلاج السرطان. استشر أخصائيي الرعاية الصحية للحصول على رعاية قائمة على الأدلة. قد تدعم الأساليب التكميلية مثل اتباع نظام غذائي متوازن وممارسة التمارين الرياضية والحد من التوتر العافية ولكن لا ينبغي أن تحل محل التدخلات الطبية. اطلبي دائماً إرشادات من الخبراء الطبيين لإدارة السرطان."]},
    {"tag":"Fever",
    "patterns":["هل يمكن أن يبدأ السرطان بحمى بسيطة"],
    "responses":["لا يسبب السرطان نفسه عادةً الحمى. ومع ذلك، يمكن أن تؤدي أنواع معينة من السرطان إلى الحمى بشكل غير مباشر. غالبًا ما تكون الحمى استجابة للعدوى، ويمكن أن يضعف السرطان الجهاز المناعي، مما يجعل الجسم أكثر عرضة للعدوى. بالإضافة إلى ذلك، يمكن أن تسبب بعض أنواع السرطان، مثل الأورام اللمفاوية، الحمى كجزء من أعراضها."]},
    {"tag":"Ayurvedha",
    "patterns":["هل هناك أي علاج للسرطان في الأيورفيدا؟",
    "ما هو الأيورفيدا في علاج السرطان",
    "أيهما أفضل الأيورفيدا أم المعالجة المثلية في علاج السرطان"],
    "responses":["لم يثبت علميًا قدرة الأيورفيدا أو المعالجة المثلية على علاج السرطان. يتطلب علاج السرطان أساليب قائمة على الأدلة مثل الجراحة والعلاج الكيميائي والعلاج الإشعاعي والعلاج المناعي. من الضروري استشارة أخصائيي الرعاية الصحية التقليدية للحصول على علاجات مثبتة بالأدلة."]},
    {"tag":"deadliness",
    "patterns":["ما مدى فتك السرطان"],
    "responses":["يمكن أن يكون للسرطان مستويات متفاوتة من الشدة والتشخيص حسب النوع والمرحلة عند التشخيص وخيارات العلاج. تتمتع بعض أنواع السرطانات بمعدلات نجاة عالية عند اكتشافها مبكراً وعلاجها بفعالية، بينما قد يكون البعض الآخر أكثر شراسة وصعب العلاج."]},
    {
        "tag": "ar_AnimalsAndCancerFactors",
        "patterns": ["هل تنقل الحيوانات أي عوامل تسبب السرطان؟", "هل يمكن للحيوانات أن تنقل عوامل السرطان؟", "العوامل من الحيوانات المسببة للسرطان"],
        "responses": ["لا يوجد دليل على أن الحيوانات تنقل العوامل المسببة للسرطان إلى البشر."]
      },
      {
        "tag": "ar_AnimalsAndCancer",
        "patterns": ["هل تصاب الحيوانات بالسرطان؟", "هل يمكن أن تصاب الحيوانات بالسرطان؟", "السرطان في الحيوانات"],
        "responses": ["نعم، يمكن أن تصاب الحيوانات بالسرطان، على الرغم من أن أنواعه قد تختلف عن سرطانات الإنسان."]
      },
      {
        "tag": "ar_CellReestablishmentAfterCancer",
        "patterns": ["هل تعيد الخلايا التي دمرها السرطان بناء نفسها؟", "إعادة بناء الخلايا بعد السرطان", "تجديد الخلايا بعد السرطان"],
        "responses": ["عادةً لا تُعيد الخلايا التي دمرها السرطان تكوين نفسها كأفراد جدد."]
      },
      {
        "tag": "ar_AliensAndCancerCure",
        "patterns": ["هل يمكن للكائنات الفضائية علاج السرطان؟", "هل يمكن للكائنات الفضائية علاج السرطان بقواها", "علاج السرطان خارج كوكب الأرض"],
        "responses": ["لا يوجد دليل علمي يدعم فكرة قدرة الكائنات الفضائية على علاج السرطان."]
      },
      {
        "tag": "ar_HairfallLesseningInChemotherapy",
        "patterns": ["هل يمكن الحد من تساقط الشعر أثناء العلاج الكيميائي؟", "الحد من تساقط الشعر أثناء علاج السرطان", "منع تساقط الشعر أثناء العلاج الكيميائي"],
        "responses": ["يمكن أن يكون تساقط الشعر من الآثار الجانبية للعلاج الكيميائي، وهناك طرق للتقليل من تساقط الشعر، مثل استخدام القبعات الباردة."]
      },
      {
        "tag": "ar_CancerTreatment",
        "patterns": ["كيف تعالج السرطان؟", "طرق علاج السرطان", "علاج السرطان"],
        "responses": ["تشمل طرق علاج السرطان الجراحة والعلاج الكيميائي والعلاج الإشعاعي والعلاج المناعي والعلاج الموجه."]
      },
      {
        "tag": "ar_CancerSymptoms",
        "patterns": ["ما هي أعراض السرطان؟", "التعرف على أعراض السرطان", "علامات السرطان"],
        "responses": ["تشمل الأعراض الشائعة للسرطان فقدان الوزن غير المبرر والتغيرات في عادات الأمعاء والسعال المستمر والكتل غير المعتادة."]
      },
      {
        "tag": "ar_IdentifyingCancer",
        "patterns": ["كيف أعرف ما إذا كنت مصابًا بالسرطان؟", "الكشف عن السرطان في المراحل المبكرة", "التعرف على السرطان في النفس"],
        "responses": ["تشمل طرق الكشف المبكر الفحوصات المنتظمة والفحوصات الذاتية والانتباه للأعراض غير المعتادة."]
      },
      {
        "tag": "ar_CancerMedicationSideEffects",
        "patterns": ["ما هي الآثار الجانبية لأدوية السرطان؟", "الآثار الجانبية لأدوية السرطان", "آثار الأدوية على السرطان"],
        "responses": ["تشمل الآثار الجانبية الشائعة لأدوية السرطان الغثيان والإرهاق وتساقط الشعر وتغيرات في الشهية."]
      },
      {
        "tag": "ar_BreastVsColonCancer",
        "patterns": ["الفرق بين سرطان الثدي وسرطان القولون", "المقارنة بين سرطان الثدي وسرطان القولون", "سرطان الثدي مقابل سرطان القولون"],
        "responses": ["يصيب سرطان الثدي في المقام الأول أنسجة الثدي، بينما يبدأ سرطان القولون في القولون أو المستقيم. وتختلف أماكن الإصابة والأعراض والعلاجات."]
      },
      {
        "tag": "ar_BreastCancerExplanation",
        "patterns": ["شرح مفصل عن سرطان الثدي", "شرح مفصل عن سرطان الثدي", "شرح شامل عن سرطان الثدي"],
        "responses": ["سرطان الثدي هو نوع من السرطان يبدأ في خلايا الثدي. ويمكن أن يصيب الرجال والنساء على حد سواء، والكشف المبكر عنه أمر بالغ الأهمية لنجاح العلاج."]
      },
      {
        "tag": "ar_TypesOfCancer",
        "patterns": ["ما هي الأنواع المختلفة للسرطان؟", "استكشاف أنواع السرطان", "سرد أنواع السرطان"],
        "responses": ["يشمل السرطان أنواعًا مختلفة من السرطان مثل سرطان الثدي والرئة والقولون والمستقيم والبروستاتا وغيرها، ولكل منها خصائص فريدة وأساليب علاجية."]
      },
      {
        "tag": "ar_NumberOfTypeOfCancers",
        "patterns": ["كم عدد أنواع السرطان الموجودة؟", "عدد أنواع السرطان", "إجمالي عدد أنواع السرطان"],
        "responses": ["هناك أكثر من 100 نوع من السرطان، ينشأ كل منها في خلايا وأنسجة مختلفة من الجسم."]
      },
      {
        "tag": "ar_IdentifyingCancerSymptoms",
        "patterns": ["كيف يمكن التعرف على السرطان بناءً على الأعراض؟", "التعرف على السرطان من خلال الأعراض", "التعرف على السرطان القائم على الأعراض"],
        "responses": ["تشمل العلامات الشائعة تغيرات مستمرة في عادات الأمعاء أو المثانة، وفقدان الوزن غير المبرر، والكتل أو الزوائد غير المعتادة."]
      },
      {
        "tag": "ar_IsChemotherapyPainful",
        "patterns": ["هل العلاج الكيميائي مؤلم؟", "الألم أثناء العلاج الكيميائي", "عدم الراحة في العلاج الكيميائي"],
        "responses": ["يمكن أن يسبب العلاج الكيميائي آثارًا جانبية مختلفة، وقد يعاني بعض الأفراد من الألم، لكن الأمر يختلف من شخص لآخر."]
      },
      {
        "tag": "ar_MethodsOfTreatingCancer",
        "patterns": ["ما هي الطرق المختلفة لعلاج السرطان", "علاج السرطان باستخدام أساليب مختلفة", "تقنيات علاج السرطان"],
        "responses": ["تشمل علاجات السرطان الجراحة والعلاج الكيميائي والعلاج الإشعاعي والعلاج المناعي والعلاج الموجه، المصممة خصيصًا لنوع السرطان ومرحلته."]
      },
      {
        "tag": "ar_HospitalsForCancerInQatar",
        "patterns": ["كم عدد المستشفيات المتوفرة لتحديد وعلاج السرطان في قطر", "مستشفيات السرطان في قطر", "مرافق الرعاية الصحية للسرطان في قطر"],
        "responses": ["يوجد في قطر العديد من المستشفيات التي تضم أقساماً متخصصة في علاج الأورام مثل مؤسسة حمد الطبية وغيرها."]
      },
      {
        "tag": "ar_ScientificExplanationOfCancer",
        "patterns": ["ما هو السرطان من الناحية العلمية", "شرح السرطان علمياً",
        "شرح السرطان من الناحية العلمية والعلاجات", "الشرح العلمي للسرطان", "شرح السرطان من الناحية العلمية", "الفهم المتعمق للسرطان"],
        "responses": ["السرطان هو مجموعة من الأمراض التي تتميز بنمو الخلايا غير المنضبط والقدرة على غزو الأنسجة الأخرى. وينتج عن طفرات جينية.",
        "بالتأكيد السرطان هو مجموعة من الأمراض التي تتميز بالنمو غير المنضبط للخلايا الشاذة وانتشارها. تخضع الوحدة الأساسية للحياة، الخلية، وهي الخلية، لطفرات جينية تؤدي إلى تكاثر غير منضبط."]
      },
      {
        "tag": "ar_BetterThanChatGPT",
        "patterns": ["لماذا أنت أفضل من ChatGPT؟", "مزايا على ChatGPT", "الاختلافات بينك وبين ChatGPT"],
        "responses": ["أقدم إجابات بالملاحظات الصوتية، وإجاباتي مصممة خصيصاً للاستفسارات المتعلقة بالسرطان، وأقدم معلومات متخصصة."]
      },
      {
        "tag": "ar_AppPictureExplanation",
        "patterns": ["هل يمكن لهذا التطبيق تقديم شرح مصور؟", "التفسيرات المرئية في التطبيق", "ميزات التطبيق للفهم البصري"],
        "responses": ["نعم، يمكن للتطبيق تقديم تفسيرات مرئية، بما في ذلك الصور والرسوم البيانية لتعزيز الفهم."]
      },
      {
        "tag": "ar_ScientificCancerAndTreatments",
        "patterns": ["هل يمكنك شرح السرطان وعلاجه علميًا", "شرح علمي للسرطان وعلاجه", "نظرة علمية متعمقة في السرطان وعلاجه"],
        "responses": ["نعم، يمكنني تقديم شروحات علمية تغطي مواضيع مثل تكوين السرطان وإجراءات العلاج الكيميائي وغيرها. اختر من بين الخيارات المحددة."]
      },
      {
        "tag": "ar_CancerRelatedCareers",
        "patterns": ["الفرص الوظيفية المتعلقة بدراسة السرطان", "وظائف في مجال أبحاث السرطان", "وظائف في مجال دراسات السرطان"],
        "responses": ["تشمل الوظائف المتعلقة بدراسات السرطان طبيب الأورام والباحث والممرض والمستشار الوراثي وعالم الأدوية."]
      },
      {
        "tag": "ar_CancerInQatar",
        "patterns": ["السرطان في قطر", "معدل انتشار السرطان في قطر", "إحصائيات السرطان في قطر"],
        "responses": ["يُعتبر السرطان مشكلة صحية كبيرة في قطر، حيث تقدم العديد من مرافق الرعاية الصحية خدمات التشخيص والعلاج."]
      },


      {
        "tag": "ar_SpecialCoursesOnCancer",
        "patterns": ["دورات خاصة للدراسة عن السرطان", "برامج تعليمية متعلقة بالسرطان", "دورات عن دراسات السرطان"],
        "responses": ["تقدم مؤسسات تعليمية مختلفة دورات متخصصة في دراسات السرطان. وتشمل بعض الأمثلة على ذلك دورات في علم الأورام وبيولوجيا السرطان وأبحاث السرطان."]
      },
      {
        "tag": "ar_VoiceNoteCapability",
        "patterns": ["لماذا أنت أفضل من ChatGPT", "مزايا هذا التطبيق على ChatGPT", "الاختلاف عن ChatGPT"],
        "responses": ["أنا أقدم ميزة فريدة من نوعها مع إمكانية تدوين الملاحظات الصوتية، مما يتيح لي تقديم إجابات بصيغة صوتية لتجربة أكثر تفاعلية وتخصيصاً."]
      },
      {
        "tag": "ar_PictureExplanationCapability",
        "patterns": ["هل يمكن لهذا التطبيق تقديم شرح مصور", "الوسائل البصرية المساعدة على الفهم", "التمثيل البياني للمعلومات"],
        "responses": ["نعم، يتمتع هذا التطبيق بالقدرة على تقديم شروحات مصورة، مما يوفر فهماً مرئياً للمعلومات المعقدة المتعلقة بالسرطان."]
      },
      {
        "tag": "ar_BetterThanGoogle",
        "patterns": ["كيف تكون أفضل من جوجل", "مزاياك على جوجل", "الاختلافات بينك وبين جوجل"],
        "responses": ["على الرغم من أن Google محرك بحث قوي، إلا أنني متخصص في توفير معلومات منسقة ومخصصة حول الموضوعات المتعلقة بالسرطان. فأنا أقدم واجهة تخاطبية، وإمكانية تدوين الملاحظات الصوتية، والقدرة على شرح المفاهيم الطبية المعقدة بطريقة يسهل الوصول إليها."]
      },
      {
        "tag": "ar_AccessToExpertInformation",
        "patterns": ["الوصول إلى معلومات الخبراء", "الخبرة في معرفة السرطان", "هل يمكنك تقديم معلومات من الخبراء"],
        "responses": ["بالتأكيد! لديّ إمكانية الوصول إلى ثروة من المعلومات من الخبراء الطبيين وقواعد البيانات البحثية، مما يضمن الحصول على تفاصيل دقيقة ومحدثة عن مختلف جوانب السرطان."]
      },
      {
        "tag": "ar_ConversationalInterfaceAdvantage",
        "patterns": ["مزايا واجهة المحادثة", "لماذا تختار روبوت المحادثة", "فوائد التحدث إلى روبوت المحادثة"],
        "responses": ["توفر واجهة المحادثة تجربة أكثر تفاعلية وتفاعلية. يمكنك طرح الأسئلة وطلب الإيضاحات وتلقي المعلومات بطريقة حوارية، مما يجعل عملية التعلم عن السرطان أكثر سهولة في الاستخدام."]
      },
      {
        "tag": "ar_PersonalizedInformation",
        "patterns": ["معلومات مخصصة عن مرض السرطان", "استجابات مصممة خصيصًا لتلبية احتياجاتي", "هل يمكنك تخصيص المعلومات لي"],
        "responses": ["بالتأكيد! يمكنني تقديم معلومات مخصصة بناءً على استفساراتك واحتياجاتك المحددة، مما يوفر تجربة أكثر ملاءمة ومناسبة مقارنةً بنتائج البحث العامة."]
      }
]}