{"intents":[
  {
    "tag": "الخدمات المقدمة",
    "patterns": ["ما هي الخدمات المقدمة في المركز الوطني لعلاج السرطان لمرضى السرطان؟"],
    "responses": ["يقدم المركز القومي للسرطان مجموعة واسعة من الخدمات بما في ذلك الرعاية التشخيصية والعلاجية والداعمة لمختلف أنواع السرطان."]
  },
  {
    "tag": "التشخيص",
    "patterns": ["كيف يتم تشخيص السرطانات في المركز الوطني للسرطان؟"],
    "responses": ["يتضمن تشخيص السرطان في المركز الوطني لعلاج الأورام السرطانية في المركز الوطني لعلاج الأورام السرطانية أحدث تقنيات التصوير بالأشعة والخزعات والفحوصات المخبرية الشاملة التي يجريها أطباء الأورام ذوي الخبرة."]
  },
  {
    "tag": "خيارات العلاج",
    "patterns": ["ما هي العلاجات المتاحة في المركز الوطني لعلاج السرطان لمرضى السرطان؟"],
    "responses": ["تشمل خيارات العلاج في المركز الوطني لعلاج الأورام السرطانية في المركز الوطني لعلاج الأورام السرطانية الجراحة والعلاج الكيميائي والعلاج الإشعاعي والعلاج الموجه والعلاج المناعي وغيرها. يعتمد اختيار العلاج على نوع السرطان ومرحلته."]
  },
  {
    "tag": "خدمات الدعم",
    "patterns": ["هل تقدمون خدمات الدعم لمرضى السرطان وعائلاتهم؟"],
    "responses": ["نعم، يقدم المركز القومي للسرطان خدمات دعم متنوعة مثل الاستشارة والدعم الغذائي والرعاية التلطيفية ومجموعات الدعم لمساعدة المرضى وعائلاتهم أثناء رحلة علاجهم من السرطان."]
  },
  {
    "tag": "موارد المرضى",
    "patterns": ["أين يمكن للمرضى الوصول إلى الموارد أو المعلومات الإضافية في المركز الوطني لعلاج الإدمان"],
    "responses": ["يمكن للمرضى العثور على موارد ومعلومات قيّمة في مناطق محددة داخل المركز الوطني لعلاج الإدمان على المخدرات، بما في ذلك المكتبات والبوابات الإلكترونية والمواد الإعلامية التي يقدمها الموظفون"]
  },
  {
    "tag": "الأبحاث والابتكارات",
    "patterns": ["هل هناك أبحاث جارية أو علاجات مبتكرة متوفرة في المركز الوطني للبحوث والابتكارات"],
    "responses": ["يشارك المركز القومي للبحوث السريرية للأطفال والمراهقين في برامج بحثية وتجارب سريرية متطورة، مما يتيح الوصول إلى أحدث التطورات والعلاجات المبتكرة للمرضى المؤهلين."]
  },
  {
    "tag": "المساعدة المالية",
    "patterns": ["هل توجد برامج مساعدة مالية لمرضى السرطان في المركز الوطني لعلاج السرطان"],
    "responses": ["يوفر المركز القومي للسرطان معلومات ومساعدة فيما يتعلق ببرامج الدعم المالي والتغطية التأمينية والموارد لمساعدة المرضى في تكاليف علاجهم."]
  },
  {
    "tag": "أنواع السرطان المعالجة",
    "patterns": ["ما أنواع السرطان التي يقدم المركز الوطني للسرطان علاجًا لها؟"],
    "responses": ["يقدم المركز الوطني لعلاج السرطان علاجًا لمجموعة واسعة من أنواع السرطان بما في ذلك سرطان الثدي وسرطان القولون والمستقيم وسرطان الرئة وسرطان البروستاتا وسرطان الدم وسرطان الغدد الليمفاوية وغيرها الكثير."]
  },
  {
    "tag": "فرق الرعاية متعددة التخصصات",
    "patterns": ["هل توجد فرق رعاية متخصصة في المركز الوطني لعلاج الإدمان"],
    "responses": ["نعم، يوجد لدى المركز القومي للسرطان فرق متعددة التخصصات تتكون من أطباء الأورام والجراحين وأخصائيي الأشعة وأخصائيي الأشعة وأخصائيي علم الأمراض والممرضات وغيرهم من الأخصائيين الذين يتعاونون لتقديم رعاية شخصية وشاملة للمرضى."]
  },
  {
    "tag": "الرعاية التلطيفية",
    "patterns": ["هل الرعاية التلطيفية متاحة لمرضى السرطان؟"],
    "responses": ["تركز خدمات الرعاية التلطيفية في المركز الوطني لعلاج الأورام السرطانية على تحسين جودة حياة المرضى وإدارة الأعراض وتقديم الدعم للمرضى وعائلاتهم طوال رحلة علاج السرطان."]
  },
  {
    "tag": "التجارب السريرية",
    "patterns": ["هل هناك فرص للمرضى للمشاركة في التجارب السريرية؟"],
    "responses": ["يوفر المركز الوطني للسرطان إمكانية الوصول إلى العديد من التجارب السريرية والدراسات البحثية، مما يسمح للمرضى المؤهلين باستكشاف علاجات جديدة والمساهمة في تطوير أبحاث السرطان."]
  },
  {
    "tag": "خدمات إعادة التأهيل",
    "patterns": ["هل تتوفر خدمات إعادة التأهيل لمرضى السرطان بعد العلاج؟"],
    "responses": ["يوفر المركز الوطني لعلاج السرطان وإعادة التأهيل خدمات إعادة التأهيل التي تهدف إلى استعادة الوظائف البدنية والتحكم في الآثار الجانبية وتعزيز الرفاهية العامة للمرضى بعد العلاج."]
  },
  {
    "tag": "التدابير الوقائية",
    "patterns": ["هل يقدم المركز الوطني للسرطان معلومات عن الوقاية من السرطان؟"],
    "responses": ["يقدم المركز الوطني للسرطان والمركز الوطني للسرطان والموارد التثقيفية والموارد حول تعديل نمط الحياة والفحوصات واستراتيجيات الكشف المبكر التي تهدف إلى الحد من خطر الإصابة بالسرطان."]
  },
  {
    "tag": "تثقيف المريض",
    "patterns": ["أين يمكن للمرضى الوصول إلى المواد التثقيفية في المركز الوطني لعلاج الإدمان"],
    "responses": ["يوفر المركز الوطني لعلاج الأورام السرطانيةيوفر المركز الوطني لعلاج الأورام السرطانية مواد تثقيفية وورش عمل وموارد عبر الإنترنت لتمكين المرضى من معرفة حالتهم وخيارات العلاج والرعاية الذاتية"]
  },
  {
    "tag": "دعم الأسرة ومقدمي الرعاية",
    "patterns": ["هل توجد خدمات دعم لأفراد الأسرة أو مقدمي الرعاية؟"],
    "responses": ["خدمات الدعم متوفرة لأفراد الأسرة ومقدمي الرعاية لمساعدتهم في التغلب على تحديات رعاية أحبائهم، بما في ذلك الاستشارات ومجموعات الدعم والجلسات التعليمية."]
  },
  {
    "tag": "متابعة الرعاية",
    "patterns": ["ماذا تتضمن رعاية المتابعة بعد الانتهاء من العلاج؟"],
    "responses": ["تشمل رعاية المتابعة في المركز الوطني لعلاج الإدمان على الكحول والمواد المخدرة فحوصات منتظمة وفحوصات ومراقبة مستمرة لضمان صحة المريض ومعالجة أي مخاوف محتملة بعد العلاج."]
  },
  {
    "tag": "العلاجات التكميلية",
    "patterns": ["هل تقدم علاجات تكميلية أو تكاملية؟"],
    "responses": ["يوفر المركز الوطني لعلاج الإدمان على المخدرات علاجات تكميلية مثل الوخز بالإبر الصينية والعلاج بالتدليك واليوغا والتأمل للمساعدة في إدارة الأعراض وتحسين الحالة العامة للمرضى."]
  },
  {
    "tag": "خدمات التطبيب عن بُعد",
    "patterns": ["هل تتوفر خدمات التطبيب عن بُعد للاستشارات؟"],
    "responses": ["تتيح خدمات التطبيب عن بُعد في المركز الوطني للبحوث الطبية عن بُعد للمرضى الحصول على الاستشارات عن بُعد، والحصول على المشورة الطبية، والمشاركة في مواعيد المتابعة دون زيارة المنشأة شخصيًا."]
  },
  {
    "tag": "المساعدة اللغوية",
    "patterns": ["هل تقدمون مساعدة لغوية لغير الناطقين بها؟"],
    "responses": ["خدمات المساعدة اللغوية متوفرة في المركز الوطني للمعلومات والاتصالات لدعم غير الناطقين بها، بما في ذلك خدمات الترجمة الفورية والمواد المترجمة."]
  },
  {
    "tag": "الدعم الغذائي",
    "patterns": ["هل الإرشادات الغذائية متاحة لمرضى السرطان؟"],
    "responses": ["يقدم المركز الوطني للسرطان استشارات غذائية ودعم غذائي لمساعدة المرضى في الحفاظ على التغذية السليمة أثناء العلاج، والتحكم في الآثار الجانبية، وتعزيز الصحة العامة."]
  }, 
      {
        "tag": "ar_Psychosocial Services",
        "patterns": ["هل تتوفر خدمات الصحة النفسية أو الخدمات النفسية الاجتماعية؟"],
        "responses": ["تتوفر خدمات الدعم النفسي والاجتماعي لمعالجة الجوانب العاطفية والنفسية والاجتماعية للتكيف مع السرطان، بما في ذلك الاستشارة والعلاج ومجموعات الدعم."]
      },
      {
        "tag": "Travel and Accommodation Assistance",
        "patterns": ["هل تقدمون مساعدة للسفر أو الإقامة؟"],
        "responses": ["يوفر المركز القومي للبحوث الجنائية والاجتماعية والثقافية المعلومات والدعم فيما يتعلق بترتيبات السفر وخيارات الإقامة والموارد المحلية للمرضى الذين يحتاجون إلى المساعدة أثناء تلقي العلاج."]
      },
      {
        "tag": "الاستشارات المالية",
        "patterns": ["هل توجد خدمات استشارات مالية متاحة؟"],
        "responses": ["خدمات الاستشارات المالية في المركز القومي للسرطان تساعد المرضى في فهم تكاليف العلاج والتغطية التأمينية وخيارات المساعدة المالية والتغلب على التحديات المالية خلال رحلة علاجهم من السرطان."]
      },
      {
        "tag":"رعاية نهاية الحياة",
        "patterns":["هل تقدمون رعاية نهاية الحياة أو خدمات رعاية المحتضرين؟"],
        "responses":["يوفر المركز القومي للبحوث الجنائية والعلاجية رعاية رحيمة في مرحلة الاحتضار وخدمات رعاية المحتضرين لضمان الراحة والكرامة للمرضى في المراحل الأخيرة من المرض."]
      },
      {
        "tag": "برامج التوعية المجتمعية",
        "patterns": ["ما هي برامج التوعية المجتمعية المتاحة؟"],
        "responses": ["يقوم المركز القومي للسرطان بتنفيذ برامج توعية ومبادرات تثقيفية متنوعة في المجتمع لزيادة الوعي وتعزيز الوقاية من السرطان ودعم جهود الكشف المبكر"]
      },
      {
        "tag": "خدمات سرطان الأطفال",
        "patterns": ["هل توجد خدمات متخصصة لمرضى سرطان الأطفال؟"],
        "responses": ["يقدم المركز الوطني لعلاج الأورام السرطانية للأطفال رعاية متخصصة مصممة خصيصًا لمرضى سرطان الأطفال، بما في ذلك مرافق ملائمة للأطفال، وأطباء أورام أطفال متخصصين وخدمات دعم مناسبة لأعمارهم."]
      },
      {
        "tag": "ar_Genetic Counseling",
        "patterns": ["هل الاستشارة الوراثية متاحة لتقييم مخاطر الإصابة بالسرطان؟"],
        "responses": ["يتم تقديم خدمات الاستشارة الوراثية لتقييم مخاطر الإصابة بالسرطان العائلي، ومناقشة خيارات الاختبارات الجينية، وتقديم الإرشادات للأفراد الذين لديهم تاريخ عائلي للإصابة بالسرطان."]
      },
      {
        "tag": "ar_Cancer Screening Programs",
        "patterns": ["هل تقدمون برامج لفحص السرطان؟"],
        "responses": ["يُجري المركز القومي للسرطان برامج فحص منتظمة للكشف عن السرطانات في مراحلها المبكرة، حيث يقدم فحوصات لسرطان الثدي والقولون والمستقيم وعنق الرحم وغيرها من أنواع السرطان بناءً على الإرشادات المعمول بها."]
      },
      {
        "tag": "ar_Workshops and Educational Events",
        "patterns": ["هل هناك ورش عمل أو فعاليات للتوعية بمرض السرطان؟"],
        "responses": ["يتم تنظيم ورش عمل تثقيفية وندوات وفعاليات توعوية في المركز الوطني للسرطان لإطلاع المجتمع على الوقاية من السرطان والتقدم في العلاج وخيارات نمط الحياة الصحي."]
      },
      {
        "tag": "ar_Technology and Treatment Innovations",
        "patterns": ["ما هي التقنيات أو العلاجات المبتكرة المستخدمة في المركز الوطني للبحوث الجنائية والمساعدة القانونية؟"],
        "responses": ["يستخدم المركز القومي للسرطان تقنيات متطورة وعلاجات مبتكرة مثل الطب الدقيق والجراحة الروبوتية وتقنيات التصوير المتقدمة لتعزيز رعاية المرضى ونتائج العلاج."]
      },
      {
        "tag": "ar_Patient Advocacy Programs",
        "patterns": ["هل توجد برامج لمناصرة حقوق مرضى السرطان ودعمهم؟"],
        "responses": ["تهدف برامج الدفاع عن المرضى في المركز القومي للبحوث الجنائية والاجتماعية والثقافية إلى حماية حقوق المرضى وتوفير الدعم والدعوة إلى تحسين الوصول إلى الرعاية والخدمات عالية الجودة."]
      },
      {
        "tag": "ar_Alternative Therapies",
        "patterns": ["هل هناك علاجات بديلة أو تكميلية متاحة؟"],
        "responses": ["يوفر المركز القومي للسرطان علاجات بديلة أو تكميلية مثل طب الأعشاب أو الوخز بالإبر أو علاجات العقل والجسم لتكملة العلاجات التقليدية للسرطان."]
      },
      {
        "tag": "ar_Cancer Survivorship Programs",
        "patterns": ["هل توجد برامج للناجين من السرطان بعد العلاج؟"],
        "responses": ["يقدم المركز القومي للسرطان برامج النجاة التي تركز على صحة الناجين من السرطان ورفاهيتهم، بما في ذلك المتابعة بعد العلاج، وإرشادات نمط الحياة، وموارد الدعم."]
      },
      {
        "tag": "ar_Cancer Registry Information",
        "patterns": ["هل يمكنني الوصول إلى معلومات من سجل السرطان؟"],
        "responses": ["المعلومات المستقاة من سجل السرطان، مثل الإحصاءات والبيانات البحثية والاتجاهات، متاحة لأخصائيي الرعاية الصحية والباحثين وصانعي السياسات لتسهيل الدراسات والمبادرات المتعلقة بالسرطان."]
      },
      {
        "tag": "ar_Patient Rights and Privacy",
        "patterns": ["ما هي حقوق المريض وسياسات الخصوصية في المركز الوطني للسرطان؟"],
        "responses": ["يضمن المركز الوطني للوقاية من الأمراض والوقاية منها حماية حقوق المرضى وخصوصيتهم وفقًا للسياسات واللوائح المعمول بها، والحفاظ على السرية واحترام استقلالية المريض."]
      },
      {
        "tag": "ar_Volunteering Opportunities",
        "patterns": ["هل هناك فرص تطوعية متاحة للأفراد المهتمين بدعم مرضى السرطان؟"],
        "responses": ["يوفر المركز الوطني لمكافحة السرطان فرص التطوع للأفراد المهتمين بدعم مرضى السرطان والمشاركة في الأنشطة المختلفة والمساهمة في المجتمع."]
      },
      {
        "tag": "ar_Caregiver Training and Resources",
        "patterns": ["هل هناك موارد أو تدريب متاح لمقدمي الرعاية؟"],
        "responses": ["يتم تقديم موارد وبرامج تدريبية لمقدمي الرعاية في المركز الوطني لمكافحة السرطان لتوفير الإرشاد والدعم والتعليم للأفراد الذين يعتنون بمرضى السرطان."]
      },
      {
        "tag": "ar_Cancer Prevention Tips",
        "patterns": ["ما هي بعض النصائح للوقاية من السرطان؟"],
        "responses": ["يوصي المركز الوطني للوقاية من السرطان بتغييرات في نمط الحياة مثل الحفاظ على نظام غذائي صحي وممارسة التمارين الرياضية بانتظام وتجنب التبغ والإفراط في تناول الكحوليات والبقاء في مأمن من أشعة الشمس والمشاركة في الفحوصات الموصى بها للكشف المبكر."]
      },
      {
        "tag": "ar_Comprehensive Care Planning",
        "patterns": ["هل هناك خطة رعاية شاملة لمرضى السرطان؟"],
        "responses": ["يضع المركز الوطني للسرطان خطط رعاية فردية تراعي الاحتياجات الفريدة لكل مريض، وتحدد خيارات العلاج والأهداف والرعاية الداعمة طوال رحلة علاج السرطان."]
      },
      {
        "tag": "ar_Infection Control Measures",
        "patterns": ["ما هي تدابير مكافحة العدوى المعمول بها لمرضى السرطان؟"],
        "responses": ["يتم تنفيذ تدابير صارمة لمكافحة العدوى، بما في ذلك بروتوكولات نظافة اليدين واحتياطات العزل والإصحاح البيئي في المركز الوطني لعلاج الأورام السرطانية لحماية مرضى السرطان الذين يعانون من نقص المناعة."]
      },
      {
        "tag": "ar_Cancer-related Pain Management",
        "patterns": ["كيف يتم التعامل مع الألم المرتبط بالسرطان في المركز الوطني لعلاج الأورام السرطانية؟"],
        "responses": ["تشمل استراتيجيات إدارة الألم في المركز القومي للسرطان أساليب دوائية وغير دوائية، بهدف تخفيف الألم المرتبط بالسرطان وتحسين جودة حياة المرضى."]
      },
      {
        "tag": "ar_Holistic Care Approach",
        "patterns": ["هل يوفر المركز القومي للسرطان نهجاً شاملاً لرعاية مرضى السرطان؟"],
        "responses": ["يتبنى المركز القومي للسرطان نهجاً شاملاً لرعاية مرضى السرطان، حيث لا يقتصر على الجوانب الجسدية فحسب، بل يتناول أيضاً الاحتياجات العاطفية والنفسية والروحية للمرضى وعائلاتهم."]
      },
      {
        "tag": "ar_Cancer Information Hotline",
        "patterns": ["هل يوجد خط ساخن أو خط مساعدة للاستفسارات المتعلقة بالسرطان؟"],
        "responses": ["يدير المركز الوطني للسرطان خطًا ساخنًا للمعلومات المتعلقة بالسرطان يعمل به متخصصون مدربون لتقديم المعلومات والدعم والتوجيه للأفراد الذين يسعون للحصول على المساعدة المتعلقة بالسرطان."]
      },
      {
        "tag": "ar_Social Support Programs",
        "patterns": ["هل هناك برامج دعم اجتماعي متاحة لمرضى السرطان؟"],
        "responses": ["يقدم المركز القومي للبحوث الاجتماعية والإنجابية برامج دعم اجتماعي متنوعة، بما في ذلك مجموعات دعم الأقران والأنشطة الاجتماعية والفعاليات المصممة للتواصل بين المرضى وتقديم الدعم العاطفي."]
      },
      {
        "tag": "ar_Transportation Services",
        "patterns": ["هل هناك مساعدة متاحة للنقل من وإلى المواعيد؟"],
        "responses": ["يتم توفير خدمات النقل لمساعدة المرضى في التنقل من المواعيد وإليها، مما يضمن الحصول على الرعاية الطبية اللازمة."]
      },
      {
        "tag": "ar_Cultural and Religious Support",
        "patterns": ["هل هناك موارد متاحة لدعم احتياجات ثقافية أو دينية محددة؟"],
        "responses": ["يستوعب المركز القومي للبحوث الجنائية والاجتماعية والثقافية الاحتياجات الثقافية والدينية المتنوعة للمرضى، ويقدم الموارد والدعم المصممة خصيصًا لتلبية التفضيلات الفردية."]
      },
      {
        "tag": "ar_Continuing Education for Healthcare Professionals",
        "patterns": ["هل توفرون فرصاً تعليمية لأخصائيي الرعاية الصحية؟"],
        "responses": ["يقدم المركز الوطني للسرطان برامج التعليم المستمر وورش العمل والمؤتمرات لأخصائيي الرعاية الصحية لتعزيز معارفهم ومهاراتهم في مجال رعاية مرضى السرطان."]
      },
      {
        "tag": "ar_Technology Access for Patients",
        "patterns": ["هل يتم تزويد المرضى بإمكانية الوصول إلى التكنولوجيا لإدارة الصحة أو المعلومات الصحية؟"],
        "responses": ["يمكن للمرضى في المركز القومي للبحوث الجنائية والعلاجية الوصول إلى الموارد التكنولوجية، بما في ذلك بوابات المرضى أو التطبيقات، لإدارة المعلومات الصحية والمواعيد والوصول إلى المواد التعليمية."]
      },
      {
        "tag": "ar_Environmental Support",
        "patterns": ["هل تقدمون الدعم فيما يتعلق بالمخاوف البيئية أو التعرض للبيئة؟"],
        "responses": ["يوفر المركز الوطني للسرطان والموارد للمرضى القلقين بشأن العوامل البيئية أو التعرض للعوامل البيئية التي قد تؤثر على صحتهم أو خطر الإصابة بالسرطان."]
      }
]

}